### 📦 Plan for `sbx/eu-west-1/infra-01/cluster-01/010_eks`
```hcl
08:10:29.308 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:10:29.308 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:10:29.309 STDOUT terraform:   + create
08:10:29.309 STDOUT terraform:  <= read (data resources)
08:10:29.309 STDOUT terraform: Terraform will perform the following actions:
08:10:29.309 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-1"] will be created
08:10:29.309 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
08:10:29.309 STDOUT terraform:       + id          = (known after apply)
08:10:29.309 STDOUT terraform:       + key         = "karpenter.sh/discovery"
08:10:29.309 STDOUT terraform:       + resource_id = "subnet-1"
08:10:29.309 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.309 STDOUT terraform:     }
08:10:29.309 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-2"] will be created
08:10:29.309 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
08:10:29.309 STDOUT terraform:       + id          = (known after apply)
08:10:29.309 STDOUT terraform:       + key         = "karpenter.sh/discovery"
08:10:29.309 STDOUT terraform:       + resource_id = "subnet-2"
08:10:29.309 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.309 STDOUT terraform:     }
08:10:29.309 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-3"] will be created
08:10:29.309 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
08:10:29.309 STDOUT terraform:       + id          = (known after apply)
08:10:29.310 STDOUT terraform:       + key         = "karpenter.sh/discovery"
08:10:29.310 STDOUT terraform:       + resource_id = "subnet-3"
08:10:29.310 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.310 STDOUT terraform:     }
08:10:29.310 STDOUT terraform:   # aws_route53_record.ns will be created
08:10:29.310 STDOUT terraform:   + resource "aws_route53_record" "ns" {
08:10:29.310 STDOUT terraform:       + allow_overwrite = (known after apply)
08:10:29.310 STDOUT terraform:       + fqdn            = (known after apply)
08:10:29.310 STDOUT terraform:       + id              = (known after apply)
08:10:29.310 STDOUT terraform:       + name            = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.310 STDOUT terraform:       + records         = (known after apply)
08:10:29.310 STDOUT terraform:       + ttl             = 300
08:10:29.310 STDOUT terraform:       + type            = "NS"
08:10:29.310 STDOUT terraform:       + zone_id         = "Z007063513EIRKOFIWQ9J"
08:10:29.310 STDOUT terraform:     }
08:10:29.310 STDOUT terraform:   # aws_route53_zone.cluster_zone will be created
08:10:29.310 STDOUT terraform:   + resource "aws_route53_zone" "cluster_zone" {
08:10:29.310 STDOUT terraform:       + arn                 = (known after apply)
08:10:29.310 STDOUT terraform:       + comment             = "Separate zone for sbx-dev-eu-west-1-cluster-01-infra-01 cluster"
08:10:29.310 STDOUT terraform:       + force_destroy       = true
08:10:29.310 STDOUT terraform:       + id                  = (known after apply)
08:10:29.310 STDOUT terraform:       + name                = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.310 STDOUT terraform:       + name_servers        = (known after apply)
08:10:29.310 STDOUT terraform:       + primary_name_server = (known after apply)
08:10:29.310 STDOUT terraform:       + tags                = (known after apply)
08:10:29.310 STDOUT terraform:       + tags_all            = (known after apply)
08:10:29.310 STDOUT terraform:       + zone_id             = (known after apply)
08:10:29.310 STDOUT terraform:     }
08:10:29.310 STDOUT terraform:   # module.certificate.aws_acm_certificate.this[0] will be created
08:10:29.310 STDOUT terraform:   + resource "aws_acm_certificate" "this" {
08:10:29.310 STDOUT terraform:       + arn                       = (known after apply)
08:10:29.310 STDOUT terraform:       + domain_name               = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.311 STDOUT terraform:       + domain_validation_options = [
08:10:29.311 STDOUT terraform:           + {
08:10:29.311 STDOUT terraform:               + domain_name           = "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.311 STDOUT terraform:               + resource_record_name  = (known after apply)
08:10:29.311 STDOUT terraform:               + resource_record_type  = (known after apply)
08:10:29.311 STDOUT terraform:               + resource_record_value = (known after apply)
08:10:29.311 STDOUT terraform:             },
08:10:29.311 STDOUT terraform:           + {
08:10:29.311 STDOUT terraform:               + domain_name           = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.311 STDOUT terraform:               + resource_record_name  = (known after apply)
08:10:29.311 STDOUT terraform:               + resource_record_type  = (known after apply)
08:10:29.311 STDOUT terraform:               + resource_record_value = (known after apply)
08:10:29.311 STDOUT terraform:             },
08:10:29.311 STDOUT terraform:         ]
08:10:29.311 STDOUT terraform:       + id                        = (known after apply)
08:10:29.311 STDOUT terraform:       + key_algorithm             = (known after apply)
08:10:29.311 STDOUT terraform:       + not_after                 = (known after apply)
08:10:29.311 STDOUT terraform:       + not_before                = (known after apply)
08:10:29.311 STDOUT terraform:       + pending_renewal           = (known after apply)
08:10:29.311 STDOUT terraform:       + renewal_eligibility       = (known after apply)
08:10:29.311 STDOUT terraform:       + renewal_summary           = (known after apply)
08:10:29.311 STDOUT terraform:       + status                    = (known after apply)
08:10:29.311 STDOUT terraform:       + subject_alternative_names = [
08:10:29.311 STDOUT terraform:           + "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
08:10:29.311 STDOUT terraform:           + "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
08:10:29.311 STDOUT terraform:         ]
08:10:29.311 STDOUT terraform:       + tags                      = {
08:10:29.311 STDOUT terraform:           + "Environment" = "dev"
08:10:29.311 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.311 STDOUT terraform:         }
08:10:29.311 STDOUT terraform:       + tags_all                  = {
08:10:29.311 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.311 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.311 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.312 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.312 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.312 STDOUT terraform:         }
08:10:29.312 STDOUT terraform:       + type                      = (known after apply)
08:10:29.312 STDOUT terraform:       + validation_emails         = (known after apply)
08:10:29.312 STDOUT terraform:       + validation_method         = "DNS"
08:10:29.312 STDOUT terraform:       + options {
08:10:29.312 STDOUT terraform:           + certificate_transparency_logging_preference = "ENABLED"
08:10:29.312 STDOUT terraform:         }
08:10:29.312 STDOUT terraform:     }
08:10:29.312 STDOUT terraform:   # module.certificate.aws_acm_certificate_validation.this[0] will be created
08:10:29.312 STDOUT terraform:   + resource "aws_acm_certificate_validation" "this" {
08:10:29.312 STDOUT terraform:       + certificate_arn         = (known after apply)
08:10:29.312 STDOUT terraform:       + id                      = (known after apply)
08:10:29.312 STDOUT terraform:       + validation_record_fqdns = (known after apply)
08:10:29.312 STDOUT terraform:       + timeouts {}
08:10:29.312 STDOUT terraform:     }
08:10:29.312 STDOUT terraform:   # module.certificate.aws_route53_record.validation[0] will be created
08:10:29.312 STDOUT terraform:   + resource "aws_route53_record" "validation" {
08:10:29.312 STDOUT terraform:       + allow_overwrite = true
08:10:29.312 STDOUT terraform:       + fqdn            = (known after apply)
08:10:29.312 STDOUT terraform:       + id              = (known after apply)
08:10:29.312 STDOUT terraform:       + name            = (known after apply)
08:10:29.312 STDOUT terraform:       + records         = (known after apply)
08:10:29.312 STDOUT terraform:       + ttl             = 60
08:10:29.312 STDOUT terraform:       + type            = (known after apply)
08:10:29.312 STDOUT terraform:       + zone_id         = (known after apply)
08:10:29.312 STDOUT terraform:     }
08:10:29.312 STDOUT terraform:   # module.cluster.data.tls_certificate.this[0] will be read during apply
08:10:29.312 STDOUT terraform:   # (config refers to values not yet known)
08:10:29.312 STDOUT terraform:  <= data "tls_certificate" "this" {
08:10:29.312 STDOUT terraform:       + certificates = (known after apply)
08:10:29.312 STDOUT terraform:       + id           = (known after apply)
08:10:29.312 STDOUT terraform:       + url          = (known after apply)
08:10:29.312 STDOUT terraform:     }
08:10:29.312 STDOUT terraform:   # module.cluster.aws_cloudwatch_log_group.this[0] will be created
08:10:29.312 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "this" {
08:10:29.312 STDOUT terraform:       + arn               = (known after apply)
08:10:29.312 STDOUT terraform:       + id                = (known after apply)
08:10:29.312 STDOUT terraform:       + log_group_class   = (known after apply)
08:10:29.313 STDOUT terraform:       + name              = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
08:10:29.313 STDOUT terraform:       + name_prefix       = (known after apply)
08:10:29.313 STDOUT terraform:       + retention_in_days = 90
08:10:29.313 STDOUT terraform:       + skip_destroy      = false
08:10:29.313 STDOUT terraform:       + tags              = {
08:10:29.313 STDOUT terraform:           + "Environment" = "dev"
08:10:29.313 STDOUT terraform:           + "Name"        = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
08:10:29.313 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.313 STDOUT terraform:         }
08:10:29.313 STDOUT terraform:       + tags_all          = {
08:10:29.313 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.313 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.313 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.313 STDOUT terraform:           + "Name"                = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
08:10:29.313 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.313 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.313 STDOUT terraform:         }
08:10:29.313 STDOUT terraform:     }
08:10:29.313 STDOUT terraform:   # module.cluster.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
08:10:29.313 STDOUT terraform:   + resource "aws_ec2_tag" "cluster_primary_security_group" {
08:10:29.313 STDOUT terraform:       + id          = (known after apply)
08:10:29.313 STDOUT terraform:       + key         = "Environment"
08:10:29.313 STDOUT terraform:       + resource_id = (known after apply)
08:10:29.313 STDOUT terraform:       + value       = "dev"
08:10:29.313 STDOUT terraform:     }
08:10:29.313 STDOUT terraform:   # module.cluster.aws_ec2_tag.cluster_primary_security_group["Terragrunt"] will be created
08:10:29.313 STDOUT terraform:   + resource "aws_ec2_tag" "cluster_primary_security_group" {
08:10:29.313 STDOUT terraform:       + id          = (known after apply)
08:10:29.313 STDOUT terraform:       + key         = "Terragrunt"
08:10:29.313 STDOUT terraform:       + resource_id = (known after apply)
08:10:29.313 STDOUT terraform:       + value       = "true"
08:10:29.313 STDOUT terraform:     }
08:10:29.313 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["CrossplaneRole"] will be created
08:10:29.313 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
08:10:29.313 STDOUT terraform:       + access_entry_arn  = (known after apply)
08:10:29.314 STDOUT terraform:       + cluster_name      = (known after apply)
08:10:29.314 STDOUT terraform:       + created_at        = (known after apply)
08:10:29.314 STDOUT terraform:       + id                = (known after apply)
08:10:29.314 STDOUT terraform:       + kubernetes_groups = [
08:10:29.314 STDOUT terraform:           + "viewer-group",
08:10:29.314 STDOUT terraform:         ]
08:10:29.314 STDOUT terraform:       + modified_at       = (known after apply)
08:10:29.314 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/CrossplaneRole"
08:10:29.314 STDOUT terraform:       + tags              = {
08:10:29.314 STDOUT terraform:           + "Environment" = "dev"
08:10:29.314 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.314 STDOUT terraform:         }
08:10:29.314 STDOUT terraform:       + tags_all          = {
08:10:29.314 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.314 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.314 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.314 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.314 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.314 STDOUT terraform:         }
08:10:29.314 STDOUT terraform:       + type              = "STANDARD"
08:10:29.314 STDOUT terraform:       + user_name         = (known after apply)
08:10:29.314 STDOUT terraform:     }
08:10:29.314 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["Terraform"] will be created
08:10:29.314 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
08:10:29.314 STDOUT terraform:       + access_entry_arn  = (known after apply)
08:10:29.314 STDOUT terraform:       + cluster_name      = (known after apply)
08:10:29.314 STDOUT terraform:       + created_at        = (known after apply)
08:10:29.314 STDOUT terraform:       + id                = (known after apply)
08:10:29.314 STDOUT terraform:       + kubernetes_groups = [
08:10:29.314 STDOUT terraform:           + "viewer-group",
08:10:29.314 STDOUT terraform:         ]
08:10:29.314 STDOUT terraform:       + modified_at       = (known after apply)
08:10:29.314 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:user/Terraform"
08:10:29.314 STDOUT terraform:       + tags              = {
08:10:29.314 STDOUT terraform:           + "Environment" = "dev"
08:10:29.314 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.314 STDOUT terraform:         }
08:10:29.314 STDOUT terraform:       + tags_all          = {
08:10:29.314 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.314 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.314 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.314 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.314 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.314 STDOUT terraform:         }
08:10:29.314 STDOUT terraform:       + type              = "STANDARD"
08:10:29.314 STDOUT terraform:       + user_name         = (known after apply)
08:10:29.314 STDOUT terraform:     }
08:10:29.314 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["cluster_creator"] will be created
08:10:29.314 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
08:10:29.314 STDOUT terraform:       + access_entry_arn  = (known after apply)
08:10:29.314 STDOUT terraform:       + cluster_name      = (known after apply)
08:10:29.315 STDOUT terraform:       + created_at        = (known after apply)
08:10:29.315 STDOUT terraform:       + id                = (known after apply)
08:10:29.315 STDOUT terraform:       + kubernetes_groups = (known after apply)
08:10:29.315 STDOUT terraform:       + modified_at       = (known after apply)
08:10:29.315 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"
08:10:29.315 STDOUT terraform:       + tags              = {
08:10:29.315 STDOUT terraform:           + "Environment" = "dev"
08:10:29.315 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.315 STDOUT terraform:         }
08:10:29.315 STDOUT terraform:       + tags_all          = {
08:10:29.315 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.315 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.315 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.315 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.315 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.315 STDOUT terraform:         }
08:10:29.315 STDOUT terraform:       + type              = "STANDARD"
08:10:29.315 STDOUT terraform:       + user_name         = (known after apply)
08:10:29.315 STDOUT terraform:     }
08:10:29.315 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["eks-admin-role"] will be created
08:10:29.315 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
08:10:29.315 STDOUT terraform:       + access_entry_arn  = (known after apply)
08:10:29.315 STDOUT terraform:       + cluster_name      = (known after apply)
08:10:29.315 STDOUT terraform:       + created_at        = (known after apply)
08:10:29.315 STDOUT terraform:       + id                = (known after apply)
08:10:29.315 STDOUT terraform:       + kubernetes_groups = [
08:10:29.315 STDOUT terraform:           + "developer-group",
08:10:29.315 STDOUT terraform:         ]
08:10:29.315 STDOUT terraform:       + modified_at       = (known after apply)
08:10:29.315 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/eks-admin-role"
08:10:29.315 STDOUT terraform:       + tags              = {
08:10:29.315 STDOUT terraform:           + "Environment" = "dev"
08:10:29.315 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.315 STDOUT terraform:         }
08:10:29.315 STDOUT terraform:       + tags_all          = {
08:10:29.315 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.315 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.315 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.315 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.315 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.315 STDOUT terraform:         }
08:10:29.315 STDOUT terraform:       + type              = "STANDARD"
08:10:29.315 STDOUT terraform:       + user_name         = (known after apply)
08:10:29.315 STDOUT terraform:     }
08:10:29.315 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["CrossplaneRole_role"] will be created
08:10:29.315 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
08:10:29.316 STDOUT terraform:       + associated_at = (known after apply)
08:10:29.316 STDOUT terraform:       + cluster_name  = (known after apply)
08:10:29.316 STDOUT terraform:       + id            = (known after apply)
08:10:29.316 STDOUT terraform:       + modified_at   = (known after apply)
08:10:29.316 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
08:10:29.316 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/CrossplaneRole"
08:10:29.316 STDOUT terraform:       + access_scope {
08:10:29.316 STDOUT terraform:           + namespaces = [
08:10:29.316 STDOUT terraform:               + "kube-system",
08:10:29.316 STDOUT terraform:             ]
08:10:29.316 STDOUT terraform:           + type       = "namespace"
08:10:29.316 STDOUT terraform:         }
08:10:29.316 STDOUT terraform:     }
08:10:29.316 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["Terraform_user"] will be created
08:10:29.316 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
08:10:29.316 STDOUT terraform:       + associated_at = (known after apply)
08:10:29.316 STDOUT terraform:       + cluster_name  = (known after apply)
08:10:29.316 STDOUT terraform:       + id            = (known after apply)
08:10:29.316 STDOUT terraform:       + modified_at   = (known after apply)
08:10:29.316 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
08:10:29.316 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:user/Terraform"
08:10:29.316 STDOUT terraform:       + access_scope {
08:10:29.316 STDOUT terraform:           + namespaces = [
08:10:29.316 STDOUT terraform:               + "kube-system",
08:10:29.316 STDOUT terraform:             ]
08:10:29.316 STDOUT terraform:           + type       = "namespace"
08:10:29.316 STDOUT terraform:         }
08:10:29.316 STDOUT terraform:     }
08:10:29.316 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
08:10:29.316 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
08:10:29.316 STDOUT terraform:       + associated_at = (known after apply)
08:10:29.316 STDOUT terraform:       + cluster_name  = (known after apply)
08:10:29.316 STDOUT terraform:       + id            = (known after apply)
08:10:29.316 STDOUT terraform:       + modified_at   = (known after apply)
08:10:29.316 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
08:10:29.316 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"
08:10:29.316 STDOUT terraform:       + access_scope {
08:10:29.316 STDOUT terraform:           + type = "cluster"
08:10:29.317 STDOUT terraform:         }
08:10:29.317 STDOUT terraform:     }
08:10:29.317 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["eks-admin-role_role"] will be created
08:10:29.317 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
08:10:29.317 STDOUT terraform:       + associated_at = (known after apply)
08:10:29.317 STDOUT terraform:       + cluster_name  = (known after apply)
08:10:29.317 STDOUT terraform:       + id            = (known after apply)
08:10:29.317 STDOUT terraform:       + modified_at   = (known after apply)
08:10:29.317 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
08:10:29.317 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/eks-admin-role"
08:10:29.317 STDOUT terraform:       + access_scope {
08:10:29.317 STDOUT terraform:           + type = "cluster"
08:10:29.317 STDOUT terraform:         }
08:10:29.317 STDOUT terraform:     }
08:10:29.317 STDOUT terraform:   # module.cluster.aws_eks_cluster.this[0] will be created
08:10:29.317 STDOUT terraform:   + resource "aws_eks_cluster" "this" {
08:10:29.317 STDOUT terraform:       + arn                           = (known after apply)
08:10:29.317 STDOUT terraform:       + bootstrap_self_managed_addons = true
08:10:29.317 STDOUT terraform:       + certificate_authority         = (known after apply)
08:10:29.317 STDOUT terraform:       + cluster_id                    = (known after apply)
08:10:29.317 STDOUT terraform:       + created_at                    = (known after apply)
08:10:29.317 STDOUT terraform:       + enabled_cluster_log_types     = [
08:10:29.317 STDOUT terraform:           + "api",
08:10:29.317 STDOUT terraform:           + "audit",
08:10:29.317 STDOUT terraform:           + "authenticator",
08:10:29.317 STDOUT terraform:           + "controllerManager",
08:10:29.317 STDOUT terraform:           + "scheduler",
08:10:29.317 STDOUT terraform:         ]
08:10:29.317 STDOUT terraform:       + endpoint                      = (known after apply)
08:10:29.317 STDOUT terraform:       + id                            = (known after apply)
08:10:29.317 STDOUT terraform:       + identity                      = (known after apply)
08:10:29.317 STDOUT terraform:       + name                          = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.317 STDOUT terraform:       + platform_version              = (known after apply)
08:10:29.317 STDOUT terraform:       + role_arn                      = (known after apply)
08:10:29.317 STDOUT terraform:       + status                        = (known after apply)
08:10:29.317 STDOUT terraform:       + tags                          = {
08:10:29.317 STDOUT terraform:           + "Environment"           = "dev"
08:10:29.317 STDOUT terraform:           + "Terragrunt"            = "true"
08:10:29.317 STDOUT terraform:           + "terraform-aws-modules" = "eks"
08:10:29.318 STDOUT terraform:         }
08:10:29.318 STDOUT terraform:       + tags_all                      = {
08:10:29.318 STDOUT terraform:           + "Data-classification"   = "internal"
08:10:29.318 STDOUT terraform:           + "Environment"           = "dev"
08:10:29.318 STDOUT terraform:           + "Managed-by"            = "terragrunt"
08:10:29.318 STDOUT terraform:           + "Organization"          = "genopsx"
08:10:29.318 STDOUT terraform:           + "Terragrunt"            = "true"
08:10:29.318 STDOUT terraform:           + "terraform-aws-modules" = "eks"
08:10:29.318 STDOUT terraform:         }
08:10:29.318 STDOUT terraform:       + version                       = "1.31"
08:10:29.318 STDOUT terraform:       + access_config {
08:10:29.318 STDOUT terraform:           + authentication_mode                         = "API_AND_CONFIG_MAP"
08:10:29.318 STDOUT terraform:           + bootstrap_cluster_creator_admin_permissions = false
08:10:29.318 STDOUT terraform:         }
08:10:29.318 STDOUT terraform:       + encryption_config {
08:10:29.318 STDOUT terraform:           + resources = [
08:10:29.318 STDOUT terraform:               + "secrets",
08:10:29.318 STDOUT terraform:             ]
08:10:29.318 STDOUT terraform:           + provider {
08:10:29.318 STDOUT terraform:               + key_arn = (known after apply)
08:10:29.318 STDOUT terraform:             }
08:10:29.318 STDOUT terraform:         }
08:10:29.318 STDOUT terraform:       + kubernetes_network_config {
08:10:29.318 STDOUT terraform:           + ip_family         = "ipv4"
08:10:29.318 STDOUT terraform:           + service_ipv4_cidr = (known after apply)
08:10:29.318 STDOUT terraform:           + service_ipv6_cidr = (known after apply)
08:10:29.318 STDOUT terraform:           + elastic_load_balancing (known after apply)
08:10:29.318 STDOUT terraform:         }
08:10:29.318 STDOUT terraform:       + timeouts {}
08:10:29.318 STDOUT terraform:       + upgrade_policy (known after apply)
08:10:29.318 STDOUT terraform:       + vpc_config {
08:10:29.318 STDOUT terraform:           + cluster_security_group_id = (known after apply)
08:10:29.318 STDOUT terraform:           + endpoint_private_access   = false
08:10:29.318 STDOUT terraform:           + endpoint_public_access    = true
08:10:29.318 STDOUT terraform:           + public_access_cidrs       = [
08:10:29.318 STDOUT terraform:               + "0.0.0.0/0",
08:10:29.318 STDOUT terraform:             ]
08:10:29.319 STDOUT terraform:           + security_group_ids        = (known after apply)
08:10:29.319 STDOUT terraform:           + subnet_ids                = [
08:10:29.319 STDOUT terraform:               + "subnet-1",
08:10:29.319 STDOUT terraform:               + "subnet-2",
08:10:29.319 STDOUT terraform:               + "subnet-3",
08:10:29.319 STDOUT terraform:               + "subnet-4",
08:10:29.319 STDOUT terraform:               + "subnet-5",
08:10:29.319 STDOUT terraform:               + "subnet-6",
08:10:29.319 STDOUT terraform:             ]
08:10:29.319 STDOUT terraform:           + vpc_id                    = (known after apply)
08:10:29.319 STDOUT terraform:         }
08:10:29.319 STDOUT terraform:     }
08:10:29.319 STDOUT terraform:   # module.cluster.aws_iam_openid_connect_provider.oidc_provider[0] will be created
08:10:29.319 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "oidc_provider" {
08:10:29.319 STDOUT terraform:       + arn             = (known after apply)
08:10:29.319 STDOUT terraform:       + client_id_list  = [
08:10:29.319 STDOUT terraform:           + "sts.amazonaws.com",
08:10:29.319 STDOUT terraform:         ]
08:10:29.319 STDOUT terraform:       + id              = (known after apply)
08:10:29.319 STDOUT terraform:       + tags            = {
08:10:29.319 STDOUT terraform:           + "Environment" = "dev"
08:10:29.319 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
08:10:29.319 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.319 STDOUT terraform:         }
08:10:29.319 STDOUT terraform:       + tags_all        = {
08:10:29.319 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.319 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.319 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.319 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
08:10:29.319 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.319 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.319 STDOUT terraform:         }
08:10:29.319 STDOUT terraform:       + thumbprint_list = (known after apply)
08:10:29.319 STDOUT terraform:       + url             = (known after apply)
08:10:29.319 STDOUT terraform:     }
08:10:29.319 STDOUT terraform:   # module.cluster.aws_iam_policy.cluster_encryption[0] will be created
08:10:29.319 STDOUT terraform:   + resource "aws_iam_policy" "cluster_encryption" {
08:10:29.319 STDOUT terraform:       + arn              = (known after apply)
08:10:29.319 STDOUT terraform:       + attachment_count = (known after apply)
08:10:29.319 STDOUT terraform:       + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
08:10:29.319 STDOUT terraform:       + id               = (known after apply)
08:10:29.319 STDOUT terraform:       + name             = (known after apply)
08:10:29.319 STDOUT terraform:       + name_prefix      = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster-ClusterEncryption"
08:10:29.320 STDOUT terraform:       + path             = "/"
08:10:29.320 STDOUT terraform:       + policy           = (known after apply)
08:10:29.320 STDOUT terraform:       + policy_id        = (known after apply)
08:10:29.320 STDOUT terraform:       + tags             = {
08:10:29.320 STDOUT terraform:           + "Environment" = "dev"
08:10:29.320 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.320 STDOUT terraform:         }
08:10:29.320 STDOUT terraform:       + tags_all         = {
08:10:29.320 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.320 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.320 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.320 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.320 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.320 STDOUT terraform:         }
08:10:29.320 STDOUT terraform:     }
08:10:29.320 STDOUT terraform:   # module.cluster.aws_iam_role.this[0] will be created
08:10:29.320 STDOUT terraform:   + resource "aws_iam_role" "this" {
08:10:29.320 STDOUT terraform:       + arn                   = (known after apply)
08:10:29.320 STDOUT terraform:       + assume_role_policy    = jsonencode(
08:10:29.320 STDOUT terraform:             {
08:10:29.320 STDOUT terraform:               + Statement = [
08:10:29.320 STDOUT terraform:                   + {
08:10:29.320 STDOUT terraform:                       + Action    = [
08:10:29.320 STDOUT terraform:                           + "sts:TagSession",
08:10:29.320 STDOUT terraform:                           + "sts:AssumeRole",
08:10:29.320 STDOUT terraform:                         ]
08:10:29.320 STDOUT terraform:                       + Effect    = "Allow"
08:10:29.320 STDOUT terraform:                       + Principal = {
08:10:29.320 STDOUT terraform:                           + Service = "eks.amazonaws.com"
08:10:29.320 STDOUT terraform:                         }
08:10:29.320 STDOUT terraform:                       + Sid       = "EKSClusterAssumeRole"
08:10:29.320 STDOUT terraform:                     },
08:10:29.320 STDOUT terraform:                 ]
08:10:29.320 STDOUT terraform:               + Version   = "2012-10-17"
08:10:29.320 STDOUT terraform:             }
08:10:29.320 STDOUT terraform:         )
08:10:29.320 STDOUT terraform:       + create_date           = (known after apply)
08:10:29.320 STDOUT terraform:       + force_detach_policies = true
08:10:29.320 STDOUT terraform:       + id                    = (known after apply)
08:10:29.320 STDOUT terraform:       + managed_policy_arns   = (known after apply)
08:10:29.320 STDOUT terraform:       + max_session_duration  = 3600
08:10:29.320 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.320 STDOUT terraform:       + name_prefix           = (known after apply)
08:10:29.320 STDOUT terraform:       + path                  = "/"
08:10:29.320 STDOUT terraform:       + tags                  = {
08:10:29.320 STDOUT terraform:           + "Environment" = "dev"
08:10:29.320 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.320 STDOUT terraform:         }
08:10:29.320 STDOUT terraform:       + tags_all              = {
08:10:29.320 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.320 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.321 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.321 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.321 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.321 STDOUT terraform:         }
08:10:29.321 STDOUT terraform:       + unique_id             = (known after apply)
08:10:29.321 STDOUT terraform:       + inline_policy (known after apply)
08:10:29.321 STDOUT terraform:     }
08:10:29.321 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
08:10:29.321 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
08:10:29.321 STDOUT terraform:       + id         = (known after apply)
08:10:29.321 STDOUT terraform:       + policy_arn = (known after apply)
08:10:29.321 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.321 STDOUT terraform:     }
08:10:29.321 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
08:10:29.321 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.321 STDOUT terraform:       + id         = (known after apply)
08:10:29.321 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
08:10:29.321 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.321 STDOUT terraform:     }
08:10:29.321 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
08:10:29.322 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.322 STDOUT terraform:       + id         = (known after apply)
08:10:29.322 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
08:10:29.322 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.322 STDOUT terraform:     }
08:10:29.322 STDOUT terraform:   # module.cluster.aws_security_group.cluster[0] will be created
08:10:29.322 STDOUT terraform:   + resource "aws_security_group" "cluster" {
08:10:29.322 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.322 STDOUT terraform:       + description            = "EKS cluster security group"
08:10:29.322 STDOUT terraform:       + egress                 = (known after apply)
08:10:29.322 STDOUT terraform:       + id                     = (known after apply)
08:10:29.322 STDOUT terraform:       + ingress                = (known after apply)
08:10:29.322 STDOUT terraform:       + name                   = (known after apply)
08:10:29.322 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster-"
08:10:29.322 STDOUT terraform:       + owner_id               = (known after apply)
08:10:29.322 STDOUT terraform:       + revoke_rules_on_delete = false
08:10:29.322 STDOUT terraform:       + tags                   = {
08:10:29.322 STDOUT terraform:           + "Environment"                                                 = "dev"
08:10:29.323 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.323 STDOUT terraform:           + "Terragrunt"                                                  = "true"
08:10:29.323 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
08:10:29.323 STDOUT terraform:         }
08:10:29.323 STDOUT terraform:       + tags_all               = {
08:10:29.323 STDOUT terraform:           + "Data-classification"                                         = "internal"
08:10:29.323 STDOUT terraform:           + "Environment"                                                 = "dev"
08:10:29.323 STDOUT terraform:           + "Managed-by"                                                  = "terragrunt"
08:10:29.323 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.323 STDOUT terraform:           + "Organization"                                                = "genopsx"
08:10:29.324 STDOUT terraform:           + "Terragrunt"                                                  = "true"
08:10:29.324 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
08:10:29.324 STDOUT terraform:         }
08:10:29.324 STDOUT terraform:       + vpc_id                 = "vpc-1234"
08:10:29.324 STDOUT terraform:     }
08:10:29.324 STDOUT terraform:   # module.cluster.aws_security_group.node[0] will be created
08:10:29.324 STDOUT terraform:   + resource "aws_security_group" "node" {
08:10:29.324 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.324 STDOUT terraform:       + description            = "EKS node shared security group"
08:10:29.324 STDOUT terraform:       + egress                 = (known after apply)
08:10:29.324 STDOUT terraform:       + id                     = (known after apply)
08:10:29.324 STDOUT terraform:       + ingress                = (known after apply)
08:10:29.324 STDOUT terraform:       + name                   = (known after apply)
08:10:29.324 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-cluster-01-infra-01-node-"
08:10:29.324 STDOUT terraform:       + owner_id               = (known after apply)
08:10:29.324 STDOUT terraform:       + revoke_rules_on_delete = false
08:10:29.324 STDOUT terraform:       + tags                   = {
08:10:29.324 STDOUT terraform:           + "Environment"                                                 = "dev"
08:10:29.325 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-node"
08:10:29.325 STDOUT terraform:           + "Terragrunt"                                                  = "true"
08:10:29.325 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
08:10:29.325 STDOUT terraform:         }
08:10:29.325 STDOUT terraform:       + tags_all               = {
08:10:29.325 STDOUT terraform:           + "Data-classification"                                         = "internal"
08:10:29.325 STDOUT terraform:           + "Environment"                                                 = "dev"
08:10:29.325 STDOUT terraform:           + "Managed-by"                                                  = "terragrunt"
08:10:29.325 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-node"
08:10:29.325 STDOUT terraform:           + "Organization"                                                = "genopsx"
08:10:29.326 STDOUT terraform:           + "Terragrunt"                                                  = "true"
08:10:29.326 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
08:10:29.326 STDOUT terraform:         }
08:10:29.326 STDOUT terraform:       + vpc_id                 = "vpc-1234"
08:10:29.326 STDOUT terraform:     }
08:10:29.326 STDOUT terraform:   # module.cluster.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
08:10:29.326 STDOUT terraform:   + resource "aws_security_group_rule" "cluster" {
08:10:29.326 STDOUT terraform:       + description              = "Node groups to cluster API"
08:10:29.326 STDOUT terraform:       + from_port                = 443
08:10:29.326 STDOUT terraform:       + id                       = (known after apply)
08:10:29.326 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.326 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.326 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.326 STDOUT terraform:       + self                     = false
08:10:29.326 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.326 STDOUT terraform:       + to_port                  = 443
08:10:29.326 STDOUT terraform:       + type                     = "ingress"
08:10:29.326 STDOUT terraform:     }
08:10:29.326 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["egress_all"] will be created
08:10:29.326 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.327 STDOUT terraform:       + cidr_blocks              = [
08:10:29.327 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.327 STDOUT terraform:         ]
08:10:29.327 STDOUT terraform:       + description              = "Allow all egress"
08:10:29.327 STDOUT terraform:       + from_port                = 0
08:10:29.327 STDOUT terraform:       + id                       = (known after apply)
08:10:29.327 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.327 STDOUT terraform:       + protocol                 = "-1"
08:10:29.327 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.327 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.327 STDOUT terraform:       + self                     = false
08:10:29.327 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.327 STDOUT terraform:       + to_port                  = 0
08:10:29.327 STDOUT terraform:       + type                     = "egress"
08:10:29.327 STDOUT terraform:     }
08:10:29.327 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_443"] will be created
08:10:29.327 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.327 STDOUT terraform:       + description              = "Cluster API to node groups"
08:10:29.327 STDOUT terraform:       + from_port                = 443
08:10:29.327 STDOUT terraform:       + id                       = (known after apply)
08:10:29.327 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.327 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.327 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.327 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.327 STDOUT terraform:       + self                     = false
08:10:29.327 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.328 STDOUT terraform:       + to_port                  = 443
08:10:29.328 STDOUT terraform:       + type                     = "ingress"
08:10:29.328 STDOUT terraform:     }
08:10:29.328 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
08:10:29.328 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.328 STDOUT terraform:       + description              = "Cluster API to node 4443/tcp webhook"
08:10:29.328 STDOUT terraform:       + from_port                = 4443
08:10:29.328 STDOUT terraform:       + id                       = (known after apply)
08:10:29.328 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.328 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.328 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.328 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.328 STDOUT terraform:       + self                     = false
08:10:29.328 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.328 STDOUT terraform:       + to_port                  = 4443
08:10:29.328 STDOUT terraform:       + type                     = "ingress"
08:10:29.328 STDOUT terraform:     }
08:10:29.328 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
08:10:29.328 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.328 STDOUT terraform:       + description              = "Cluster API to node 6443/tcp webhook"
08:10:29.328 STDOUT terraform:       + from_port                = 6443
08:10:29.328 STDOUT terraform:       + id                       = (known after apply)
08:10:29.328 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.328 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.328 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.328 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.328 STDOUT terraform:       + self                     = false
08:10:29.328 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.328 STDOUT terraform:       + to_port                  = 6443
08:10:29.328 STDOUT terraform:       + type                     = "ingress"
08:10:29.328 STDOUT terraform:     }
08:10:29.328 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
08:10:29.329 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.329 STDOUT terraform:       + description              = "Cluster API to node 8443/tcp webhook"
08:10:29.329 STDOUT terraform:       + from_port                = 8443
08:10:29.329 STDOUT terraform:       + id                       = (known after apply)
08:10:29.329 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.329 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.329 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.329 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.329 STDOUT terraform:       + self                     = false
08:10:29.329 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.329 STDOUT terraform:       + to_port                  = 8443
08:10:29.329 STDOUT terraform:       + type                     = "ingress"
08:10:29.329 STDOUT terraform:     }
08:10:29.329 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
08:10:29.329 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.329 STDOUT terraform:       + description              = "Cluster API to node 9443/tcp webhook"
08:10:29.329 STDOUT terraform:       + from_port                = 9443
08:10:29.329 STDOUT terraform:       + id                       = (known after apply)
08:10:29.329 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.329 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.329 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.329 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.329 STDOUT terraform:       + self                     = false
08:10:29.329 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.329 STDOUT terraform:       + to_port                  = 9443
08:10:29.329 STDOUT terraform:       + type                     = "ingress"
08:10:29.329 STDOUT terraform:     }
08:10:29.329 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
08:10:29.329 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.329 STDOUT terraform:       + description              = "Cluster API to node kubelets"
08:10:29.329 STDOUT terraform:       + from_port                = 10250
08:10:29.329 STDOUT terraform:       + id                       = (known after apply)
08:10:29.329 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.329 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.329 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.329 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.329 STDOUT terraform:       + self                     = false
08:10:29.329 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.330 STDOUT terraform:       + to_port                  = 10250
08:10:29.330 STDOUT terraform:       + type                     = "ingress"
08:10:29.330 STDOUT terraform:     }
08:10:29.330 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
08:10:29.330 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.330 STDOUT terraform:       + description              = "Node to node ingress on ephemeral ports"
08:10:29.330 STDOUT terraform:       + from_port                = 1025
08:10:29.330 STDOUT terraform:       + id                       = (known after apply)
08:10:29.330 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.330 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.330 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.330 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.330 STDOUT terraform:       + self                     = true
08:10:29.330 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.330 STDOUT terraform:       + to_port                  = 65535
08:10:29.330 STDOUT terraform:       + type                     = "ingress"
08:10:29.330 STDOUT terraform:     }
08:10:29.330 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
08:10:29.330 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.330 STDOUT terraform:       + description              = "Node to node CoreDNS"
08:10:29.330 STDOUT terraform:       + from_port                = 53
08:10:29.330 STDOUT terraform:       + id                       = (known after apply)
08:10:29.330 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.330 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.330 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.330 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.330 STDOUT terraform:       + self                     = true
08:10:29.330 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.330 STDOUT terraform:       + to_port                  = 53
08:10:29.330 STDOUT terraform:       + type                     = "ingress"
08:10:29.330 STDOUT terraform:     }
08:10:29.330 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
08:10:29.330 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
08:10:29.330 STDOUT terraform:       + description              = "Node to node CoreDNS UDP"
08:10:29.330 STDOUT terraform:       + from_port                = 53
08:10:29.330 STDOUT terraform:       + id                       = (known after apply)
08:10:29.330 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.330 STDOUT terraform:       + protocol                 = "udp"
08:10:29.330 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.331 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.331 STDOUT terraform:       + self                     = true
08:10:29.331 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.331 STDOUT terraform:       + to_port                  = 53
08:10:29.331 STDOUT terraform:       + type                     = "ingress"
08:10:29.331 STDOUT terraform:     }
08:10:29.331 STDOUT terraform:   # module.cluster.time_sleep.this[0] will be created
08:10:29.331 STDOUT terraform:   + resource "time_sleep" "this" {
08:10:29.331 STDOUT terraform:       + create_duration = "30s"
08:10:29.331 STDOUT terraform:       + id              = (known after apply)
08:10:29.331 STDOUT terraform:       + triggers        = {
08:10:29.331 STDOUT terraform:           + "cluster_certificate_authority_data" = (known after apply)
08:10:29.331 STDOUT terraform:           + "cluster_endpoint"                   = (known after apply)
08:10:29.331 STDOUT terraform:           + "cluster_name"                       = (known after apply)
08:10:29.331 STDOUT terraform:           + "cluster_service_cidr"               = (known after apply)
08:10:29.331 STDOUT terraform:           + "cluster_version"                    = "1.31"
08:10:29.331 STDOUT terraform:         }
08:10:29.331 STDOUT terraform:     }
08:10:29.331 STDOUT terraform:   # module.eks_addons.aws_eks_addon.this[0] will be created
08:10:29.331 STDOUT terraform:   + resource "aws_eks_addon" "this" {
08:10:29.331 STDOUT terraform:       + addon_name                  = "amazon-cloudwatch-observability"
08:10:29.331 STDOUT terraform:       + addon_version               = (known after apply)
08:10:29.331 STDOUT terraform:       + arn                         = (known after apply)
08:10:29.331 STDOUT terraform:       + cluster_name                = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.331 STDOUT terraform:       + configuration_values        = (known after apply)
08:10:29.331 STDOUT terraform:       + created_at                  = (known after apply)
08:10:29.331 STDOUT terraform:       + id                          = (known after apply)
08:10:29.331 STDOUT terraform:       + modified_at                 = (known after apply)
08:10:29.331 STDOUT terraform:       + resolve_conflicts_on_create = "OVERWRITE"
08:10:29.331 STDOUT terraform:       + tags                        = {
08:10:29.331 STDOUT terraform:           + "Environment" = "dev"
08:10:29.331 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.331 STDOUT terraform:         }
08:10:29.331 STDOUT terraform:       + tags_all                    = {
08:10:29.331 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.332 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.332 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.332 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.332 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.332 STDOUT terraform:         }
08:10:29.332 STDOUT terraform:     }
08:10:29.332 STDOUT terraform:   # module.eks_addons.aws_eks_addon.this[1] will be created
08:10:29.332 STDOUT terraform:   + resource "aws_eks_addon" "this" {
08:10:29.332 STDOUT terraform:       + addon_name                  = "eks-pod-identity-agent"
08:10:29.332 STDOUT terraform:       + addon_version               = (known after apply)
08:10:29.332 STDOUT terraform:       + arn                         = (known after apply)
08:10:29.332 STDOUT terraform:       + cluster_name                = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.334 STDOUT terraform:       + configuration_values        = (known after apply)
08:10:29.334 STDOUT terraform:       + created_at                  = (known after apply)
08:10:29.334 STDOUT terraform:       + id                          = (known after apply)
08:10:29.334 STDOUT terraform:       + modified_at                 = (known after apply)
08:10:29.334 STDOUT terraform:       + resolve_conflicts_on_create = "OVERWRITE"
08:10:29.335 STDOUT terraform:       + tags                        = {
08:10:29.335 STDOUT terraform:           + "Environment" = "dev"
08:10:29.335 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.335 STDOUT terraform:         }
08:10:29.335 STDOUT terraform:       + tags_all                    = {
08:10:29.335 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.335 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.335 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.335 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.335 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.335 STDOUT terraform:         }
08:10:29.335 STDOUT terraform:     }
08:10:29.335 STDOUT terraform:   # module.ingress_alb_access_logs.aws_s3_bucket_notification.alb_access_logs_bucket will be created
08:10:29.335 STDOUT terraform:   + resource "aws_s3_bucket_notification" "alb_access_logs_bucket" {
08:10:29.335 STDOUT terraform:       + bucket      = (known after apply)
08:10:29.335 STDOUT terraform:       + eventbridge = true
08:10:29.335 STDOUT terraform:       + id          = (known after apply)
08:10:29.335 STDOUT terraform:     }
08:10:29.335 STDOUT terraform:   # module.ingress_alb_access_logs.aws_s3_bucket_policy.app_policy will be created
08:10:29.335 STDOUT terraform:   + resource "aws_s3_bucket_policy" "app_policy" {
08:10:29.335 STDOUT terraform:       + bucket = (known after apply)
08:10:29.335 STDOUT terraform:       + id     = (known after apply)
08:10:29.335 STDOUT terraform:       + policy = (known after apply)
08:10:29.335 STDOUT terraform:     }
08:10:29.335 STDOUT terraform:   # module.nodes["my-app-eks-x86"].data.aws_iam_policy_document.additional_policy will be read during apply
08:10:29.335 STDOUT terraform:   # (depends on a resource or a module with changes pending)
08:10:29.335 STDOUT terraform:  <= data "aws_iam_policy_document" "additional_policy" {
08:10:29.335 STDOUT terraform:       + id            = (known after apply)
08:10:29.335 STDOUT terraform:       + json          = (known after apply)
08:10:29.335 STDOUT terraform:       + minified_json = (known after apply)
08:10:29.335 STDOUT terraform:       + statement {
08:10:29.335 STDOUT terraform:           + actions   = [
08:10:29.335 STDOUT terraform:               + "ec2:*",
08:10:29.335 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
08:10:29.335 STDOUT terraform:               + "ecr:BatchGetImage",
08:10:29.335 STDOUT terraform:               + "ecr:DescribeImageScanFindings",
08:10:29.335 STDOUT terraform:               + "ecr:DescribeImages",
08:10:29.335 STDOUT terraform:               + "ecr:DescribeRepositories",
08:10:29.335 STDOUT terraform:               + "ecr:GetAuthorizationToken",
08:10:29.335 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
08:10:29.335 STDOUT terraform:               + "ecr:GetLifecyclePolicy",
08:10:29.335 STDOUT terraform:               + "ecr:GetLifecyclePolicyPreview",
08:10:29.335 STDOUT terraform:               + "ecr:GetRepositoryPolicy",
08:10:29.335 STDOUT terraform:               + "ecr:ListImages",
08:10:29.335 STDOUT terraform:               + "ecr:ListTagsForResource",
08:10:29.335 STDOUT terraform:               + "elasticfilesystem:*",
08:10:29.336 STDOUT terraform:               + "events:*",
08:10:29.336 STDOUT terraform:               + "iam:PassRole",
08:10:29.336 STDOUT terraform:               + "logs:*",
08:10:29.336 STDOUT terraform:             ]
08:10:29.336 STDOUT terraform:           + effect    = "Allow"
08:10:29.336 STDOUT terraform:           + resources = [
08:10:29.336 STDOUT terraform:               + "*",
08:10:29.336 STDOUT terraform:             ]
08:10:29.336 STDOUT terraform:         }
08:10:29.336 STDOUT terraform:     }
08:10:29.336 STDOUT terraform:   # module.nodes["my-app-eks-x86"].aws_autoscaling_policy.eks_autoscaling_policy[0] will be created
08:10:29.336 STDOUT terraform:   + resource "aws_autoscaling_policy" "eks_autoscaling_policy" {
08:10:29.336 STDOUT terraform:       + arn                     = (known after apply)
08:10:29.336 STDOUT terraform:       + autoscaling_group_name  = (known after apply)
08:10:29.336 STDOUT terraform:       + enabled                 = true
08:10:29.336 STDOUT terraform:       + id                      = (known after apply)
08:10:29.336 STDOUT terraform:       + metric_aggregation_type = (known after apply)
08:10:29.336 STDOUT terraform:       + name                    = (known after apply)
08:10:29.336 STDOUT terraform:       + policy_type             = "TargetTrackingScaling"
08:10:29.336 STDOUT terraform:       + target_tracking_configuration {
08:10:29.336 STDOUT terraform:           + disable_scale_in = false
08:10:29.336 STDOUT terraform:           + target_value     = 30
08:10:29.336 STDOUT terraform:           + predefined_metric_specification {
08:10:29.336 STDOUT terraform:               + predefined_metric_type = "ASGAverageCPUUtilization"
08:10:29.336 STDOUT terraform:             }
08:10:29.336 STDOUT terraform:         }
08:10:29.336 STDOUT terraform:     }
08:10:29.336 STDOUT terraform:   # module.nodes["my-app-eks-x86"].random_id.additional_id will be created
08:10:29.336 STDOUT terraform:   + resource "random_id" "additional_id" {
08:10:29.336 STDOUT terraform:       + b64_std     = (known after apply)
08:10:29.336 STDOUT terraform:       + b64_url     = (known after apply)
08:10:29.336 STDOUT terraform:       + byte_length = 8
08:10:29.336 STDOUT terraform:       + dec         = (known after apply)
08:10:29.336 STDOUT terraform:       + hex         = (known after apply)
08:10:29.336 STDOUT terraform:       + id          = (known after apply)
08:10:29.336 STDOUT terraform:     }
08:10:29.336 STDOUT terraform:   # module.cluster.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
08:10:29.336 STDOUT terraform:   # (config refers to values not yet known)
08:10:29.336 STDOUT terraform:  <= data "aws_iam_policy_document" "this" {
08:10:29.336 STDOUT terraform:       + id                        = (known after apply)
08:10:29.336 STDOUT terraform:       + json                      = (known after apply)
08:10:29.336 STDOUT terraform:       + minified_json             = (known after apply)
08:10:29.336 STDOUT terraform:       + override_policy_documents = []
08:10:29.336 STDOUT terraform:       + source_policy_documents   = []
08:10:29.336 STDOUT terraform:       + statement {
08:10:29.336 STDOUT terraform:           + actions   = [
08:10:29.336 STDOUT terraform:               + "kms:*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + resources = [
08:10:29.337 STDOUT terraform:               + "*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + sid       = "Default"
08:10:29.337 STDOUT terraform:           + principals {
08:10:29.337 STDOUT terraform:               + identifiers = [
08:10:29.337 STDOUT terraform:                   + "arn:aws:iam::955769636964:root",
08:10:29.337 STDOUT terraform:                 ]
08:10:29.337 STDOUT terraform:               + type        = "AWS"
08:10:29.337 STDOUT terraform:             }
08:10:29.337 STDOUT terraform:         }
08:10:29.337 STDOUT terraform:       + statement {
08:10:29.337 STDOUT terraform:           + actions   = [
08:10:29.337 STDOUT terraform:               + "kms:CancelKeyDeletion",
08:10:29.337 STDOUT terraform:               + "kms:Create*",
08:10:29.337 STDOUT terraform:               + "kms:Delete*",
08:10:29.337 STDOUT terraform:               + "kms:Describe*",
08:10:29.337 STDOUT terraform:               + "kms:Disable*",
08:10:29.337 STDOUT terraform:               + "kms:Enable*",
08:10:29.337 STDOUT terraform:               + "kms:Get*",
08:10:29.337 STDOUT terraform:               + "kms:ImportKeyMaterial",
08:10:29.337 STDOUT terraform:               + "kms:List*",
08:10:29.337 STDOUT terraform:               + "kms:Put*",
08:10:29.337 STDOUT terraform:               + "kms:ReplicateKey",
08:10:29.337 STDOUT terraform:               + "kms:Revoke*",
08:10:29.337 STDOUT terraform:               + "kms:ScheduleKeyDeletion",
08:10:29.337 STDOUT terraform:               + "kms:TagResource",
08:10:29.337 STDOUT terraform:               + "kms:UntagResource",
08:10:29.337 STDOUT terraform:               + "kms:Update*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + resources = [
08:10:29.337 STDOUT terraform:               + "*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + sid       = "KeyAdministration"
08:10:29.337 STDOUT terraform:           + principals {
08:10:29.337 STDOUT terraform:               + identifiers = [
08:10:29.337 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964",
08:10:29.337 STDOUT terraform:                 ]
08:10:29.337 STDOUT terraform:               + type        = "AWS"
08:10:29.337 STDOUT terraform:             }
08:10:29.337 STDOUT terraform:         }
08:10:29.337 STDOUT terraform:       + statement {
08:10:29.337 STDOUT terraform:           + actions   = [
08:10:29.337 STDOUT terraform:               + "kms:Decrypt",
08:10:29.337 STDOUT terraform:               + "kms:DescribeKey",
08:10:29.337 STDOUT terraform:               + "kms:Encrypt",
08:10:29.337 STDOUT terraform:               + "kms:GenerateDataKey*",
08:10:29.337 STDOUT terraform:               + "kms:ReEncrypt*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + resources = [
08:10:29.337 STDOUT terraform:               + "*",
08:10:29.337 STDOUT terraform:             ]
08:10:29.337 STDOUT terraform:           + sid       = "KeyUsage"
08:10:29.337 STDOUT terraform:           + principals {
08:10:29.337 STDOUT terraform:               + identifiers = [
08:10:29.337 STDOUT terraform:                   + (known after apply),
08:10:29.337 STDOUT terraform:                 ]
08:10:29.337 STDOUT terraform:               + type        = "AWS"
08:10:29.337 STDOUT terraform:             }
08:10:29.337 STDOUT terraform:         }
08:10:29.337 STDOUT terraform:     }
08:10:29.337 STDOUT terraform:   # module.cluster.module.kms.aws_kms_alias.this["cluster"] will be created
08:10:29.337 STDOUT terraform:   + resource "aws_kms_alias" "this" {
08:10:29.337 STDOUT terraform:       + arn            = (known after apply)
08:10:29.338 STDOUT terraform:       + id             = (known after apply)
08:10:29.338 STDOUT terraform:       + name           = "alias/eks/sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.338 STDOUT terraform:       + name_prefix    = (known after apply)
08:10:29.338 STDOUT terraform:       + target_key_arn = (known after apply)
08:10:29.338 STDOUT terraform:       + target_key_id  = (known after apply)
08:10:29.338 STDOUT terraform:     }
08:10:29.338 STDOUT terraform:   # module.cluster.module.kms.aws_kms_key.this[0] will be created
08:10:29.338 STDOUT terraform:   + resource "aws_kms_key" "this" {
08:10:29.338 STDOUT terraform:       + arn                                = (known after apply)
08:10:29.338 STDOUT terraform:       + bypass_policy_lockout_safety_check = false
08:10:29.338 STDOUT terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
08:10:29.338 STDOUT terraform:       + description                        = "sbx-dev-eu-west-1-cluster-01-infra-01 cluster encryption key"
08:10:29.338 STDOUT terraform:       + enable_key_rotation                = true
08:10:29.338 STDOUT terraform:       + id                                 = (known after apply)
08:10:29.338 STDOUT terraform:       + is_enabled                         = true
08:10:29.338 STDOUT terraform:       + key_id                             = (known after apply)
08:10:29.338 STDOUT terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
08:10:29.338 STDOUT terraform:       + multi_region                       = false
08:10:29.338 STDOUT terraform:       + policy                             = (known after apply)
08:10:29.338 STDOUT terraform:       + rotation_period_in_days            = (known after apply)
08:10:29.338 STDOUT terraform:       + tags                               = {
08:10:29.338 STDOUT terraform:           + "Environment"           = "dev"
08:10:29.338 STDOUT terraform:           + "Terragrunt"            = "true"
08:10:29.338 STDOUT terraform:           + "terraform-aws-modules" = "eks"
08:10:29.338 STDOUT terraform:         }
08:10:29.338 STDOUT terraform:       + tags_all                           = {
08:10:29.338 STDOUT terraform:           + "Data-classification"   = "internal"
08:10:29.338 STDOUT terraform:           + "Environment"           = "dev"
08:10:29.338 STDOUT terraform:           + "Managed-by"            = "terragrunt"
08:10:29.338 STDOUT terraform:           + "Organization"          = "genopsx"
08:10:29.338 STDOUT terraform:           + "Terragrunt"            = "true"
08:10:29.338 STDOUT terraform:           + "terraform-aws-modules" = "eks"
08:10:29.338 STDOUT terraform:         }
08:10:29.338 STDOUT terraform:     }
08:10:29.338 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.data.aws_iam_policy_document.this[0] will be read during apply
08:10:29.339 STDOUT terraform:   # (config refers to values not yet known)
08:10:29.339 STDOUT terraform:  <= data "aws_iam_policy_document" "this" {
08:10:29.339 STDOUT terraform:       + id                        = (known after apply)
08:10:29.339 STDOUT terraform:       + json                      = (known after apply)
08:10:29.339 STDOUT terraform:       + minified_json             = (known after apply)
08:10:29.339 STDOUT terraform:       + override_policy_documents = []
08:10:29.339 STDOUT terraform:       + source_policy_documents   = []
08:10:29.339 STDOUT terraform:       + statement {
08:10:29.339 STDOUT terraform:           + actions   = [
08:10:29.339 STDOUT terraform:               + "kms:*",
08:10:29.339 STDOUT terraform:             ]
08:10:29.339 STDOUT terraform:           + resources = [
08:10:29.339 STDOUT terraform:               + "*",
08:10:29.339 STDOUT terraform:             ]
08:10:29.339 STDOUT terraform:           + sid       = "Default"
08:10:29.339 STDOUT terraform:           + principals {
08:10:29.339 STDOUT terraform:               + identifiers = [
08:10:29.339 STDOUT terraform:                   + "arn:aws:iam::955769636964:root",
08:10:29.339 STDOUT terraform:                 ]
08:10:29.339 STDOUT terraform:               + type        = "AWS"
08:10:29.339 STDOUT terraform:             }
08:10:29.339 STDOUT terraform:         }
08:10:29.339 STDOUT terraform:       + statement {
08:10:29.339 STDOUT terraform:           + actions   = [
08:10:29.339 STDOUT terraform:               + "kms:CancelKeyDeletion",
08:10:29.339 STDOUT terraform:               + "kms:Create*",
08:10:29.339 STDOUT terraform:               + "kms:Delete*",
08:10:29.339 STDOUT terraform:               + "kms:Describe*",
08:10:29.339 STDOUT terraform:               + "kms:Disable*",
08:10:29.339 STDOUT terraform:               + "kms:Enable*",
08:10:29.339 STDOUT terraform:               + "kms:Get*",
08:10:29.339 STDOUT terraform:               + "kms:ImportKeyMaterial",
08:10:29.339 STDOUT terraform:               + "kms:List*",
08:10:29.339 STDOUT terraform:               + "kms:Put*",
08:10:29.339 STDOUT terraform:               + "kms:ReplicateKey",
08:10:29.339 STDOUT terraform:               + "kms:Revoke*",
08:10:29.339 STDOUT terraform:               + "kms:ScheduleKeyDeletion",
08:10:29.339 STDOUT terraform:               + "kms:TagResource",
08:10:29.339 STDOUT terraform:               + "kms:UntagResource",
08:10:29.339 STDOUT terraform:               + "kms:Update*",
08:10:29.339 STDOUT terraform:             ]
08:10:29.339 STDOUT terraform:           + resources = [
08:10:29.339 STDOUT terraform:               + "*",
08:10:29.339 STDOUT terraform:             ]
08:10:29.339 STDOUT terraform:           + sid       = "KeyAdministration"
08:10:29.339 STDOUT terraform:           + principals {
08:10:29.339 STDOUT terraform:               + identifiers = [
08:10:29.339 STDOUT terraform:                   + "arn:aws:sts::955769636964:assumed-role/deployment-terragrunt-genopsx-eu-west-1-955769636964/githubactionsession",
08:10:29.339 STDOUT terraform:                 ]
08:10:29.339 STDOUT terraform:               + type        = "AWS"
08:10:29.339 STDOUT terraform:             }
08:10:29.339 STDOUT terraform:         }
08:10:29.339 STDOUT terraform:       + statement {
08:10:29.339 STDOUT terraform:           + actions   = [
08:10:29.339 STDOUT terraform:               + "kms:Decrypt",
08:10:29.339 STDOUT terraform:               + "kms:DescribeKey",
08:10:29.339 STDOUT terraform:               + "kms:Encrypt",
08:10:29.339 STDOUT terraform:               + "kms:GenerateDataKey*",
08:10:29.339 STDOUT terraform:               + "kms:ReEncrypt*",
08:10:29.339 STDOUT terraform:             ]
08:10:29.339 STDOUT terraform:           + resources = [
08:10:29.340 STDOUT terraform:               + "*",
08:10:29.340 STDOUT terraform:             ]
08:10:29.340 STDOUT terraform:           + sid       = "KeyServiceRolesASG"
08:10:29.340 STDOUT terraform:           + principals {
08:10:29.340 STDOUT terraform:               + identifiers = [
08:10:29.340 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
08:10:29.340 STDOUT terraform:                   + (known after apply),
08:10:29.340 STDOUT terraform:                 ]
08:10:29.340 STDOUT terraform:               + type        = "AWS"
08:10:29.340 STDOUT terraform:             }
08:10:29.340 STDOUT terraform:         }
08:10:29.340 STDOUT terraform:       + statement {
08:10:29.340 STDOUT terraform:           + actions   = [
08:10:29.340 STDOUT terraform:               + "kms:CreateGrant",
08:10:29.340 STDOUT terraform:             ]
08:10:29.340 STDOUT terraform:           + resources = [
08:10:29.340 STDOUT terraform:               + "*",
08:10:29.340 STDOUT terraform:             ]
08:10:29.340 STDOUT terraform:           + sid       = "KeyServiceRolesASGPersistentVol"
08:10:29.340 STDOUT terraform:           + condition {
08:10:29.340 STDOUT terraform:               + test     = "Bool"
08:10:29.340 STDOUT terraform:               + values   = [
08:10:29.340 STDOUT terraform:                   + "true",
08:10:29.340 STDOUT terraform:                 ]
08:10:29.340 STDOUT terraform:               + variable = "kms:GrantIsForAWSResource"
08:10:29.340 STDOUT terraform:             }
08:10:29.340 STDOUT terraform:           + principals {
08:10:29.340 STDOUT terraform:               + identifiers = [
08:10:29.340 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
08:10:29.340 STDOUT terraform:                   + (known after apply),
08:10:29.340 STDOUT terraform:                 ]
08:10:29.340 STDOUT terraform:               + type        = "AWS"
08:10:29.340 STDOUT terraform:             }
08:10:29.340 STDOUT terraform:         }
08:10:29.340 STDOUT terraform:     }
08:10:29.340 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.aws_kms_alias.this["kms/sbx-dev-eu-west-1-cluster-01-infra-01/ebs"] will be created
08:10:29.340 STDOUT terraform:   + resource "aws_kms_alias" "this" {
08:10:29.340 STDOUT terraform:       + arn            = (known after apply)
08:10:29.340 STDOUT terraform:       + id             = (known after apply)
08:10:29.340 STDOUT terraform:       + name           = "alias/kms/sbx-dev-eu-west-1-cluster-01-infra-01/ebs"
08:10:29.340 STDOUT terraform:       + name_prefix    = (known after apply)
08:10:29.340 STDOUT terraform:       + target_key_arn = (known after apply)
08:10:29.340 STDOUT terraform:       + target_key_id  = (known after apply)
08:10:29.340 STDOUT terraform:     }
08:10:29.340 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.aws_kms_key.this[0] will be created
08:10:29.340 STDOUT terraform:   + resource "aws_kms_key" "this" {
08:10:29.340 STDOUT terraform:       + arn                                = (known after apply)
08:10:29.341 STDOUT terraform:       + bypass_policy_lockout_safety_check = false
08:10:29.341 STDOUT terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
08:10:29.341 STDOUT terraform:       + description                        = "Customer managed key to encrypt EKS managed node group volumes"
08:10:29.341 STDOUT terraform:       + enable_key_rotation                = true
08:10:29.341 STDOUT terraform:       + id                                 = (known after app
08:10:29.341 STDOUT terraform: ly)
08:10:29.341 STDOUT terraform:       + is_enabled                         = true
08:10:29.341 STDOUT terraform:       + key_id                             = (known after apply)
08:10:29.341 STDOUT terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
08:10:29.341 STDOUT terraform:       + multi_region                       = false
08:10:29.341 STDOUT terraform:       + policy                             = (known after apply)
08:10:29.341 STDOUT terraform:       + rotation_period_in_days            = (known after apply)
08:10:29.341 STDOUT terraform:       + tags                               = {
08:10:29.341 STDOUT terraform:           + "Environment" = "dev"
08:10:29.341 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.341 STDOUT terraform:         }
08:10:29.341 STDOUT terraform:       + tags_all                           = {
08:10:29.341 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.341 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.341 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.341 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.341 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.342 STDOUT terraform:         }
08:10:29.342 STDOUT terraform:     }
08:10:29.342 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_eks_fargate_profile.this[0] will be created
08:10:29.342 STDOUT terraform:   + resource "aws_eks_fargate_profile" "this" {
08:10:29.342 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.342 STDOUT terraform:       + cluster_name           = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.342 STDOUT terraform:       + fargate_profile_name   = "demo"
08:10:29.342 STDOUT terraform:       + id                     = (known after apply)
08:10:29.342 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
08:10:29.342 STDOUT terraform:       + status                 = (known after apply)
08:10:29.342 STDOUT terraform:       + subnet_ids             = [
08:10:29.342 STDOUT terraform:           + "subnet-4",
08:10:29.342 STDOUT terraform:           + "subnet-5",
08:10:29.342 STDOUT terraform:           + "subnet-6",
08:10:29.342 STDOUT terraform:         ]
08:10:29.342 STDOUT terraform:       + tags                   = {
08:10:29.342 STDOUT terraform:           + "Environment" = "dev"
08:10:29.342 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.342 STDOUT terraform:         }
08:10:29.342 STDOUT terraform:       + tags_all               = {
08:10:29.342 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.342 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.342 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.342 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.342 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.342 STDOUT terraform:         }
08:10:29.342 STDOUT terraform:       + selector {
08:10:29.342 STDOUT terraform:           + namespace = "demo"
08:10:29.342 STDOUT terraform:         }
08:10:29.343 STDOUT terraform:       + timeouts {
08:10:29.343 STDOUT terraform:           + create = "5m"
08:10:29.343 STDOUT terraform:         }
08:10:29.343 STDOUT terraform:     }
08:10:29.343 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role.this[0] will be created
08:10:29.343 STDOUT terraform:   + resource "aws_iam_role" "this" {
08:10:29.343 STDOUT terraform:       + arn                   = (known after apply)
08:10:29.343 STDOUT terraform:       + assume_role_policy    = jsonencode(
08:10:29.343 STDOUT terraform:             {
08:10:29.343 STDOUT terraform:               + Statement = [
08:10:29.343 STDOUT terraform:                   + {
08:10:29.343 STDOUT terraform:                       + Action    = "sts:AssumeRole"
08:10:29.343 STDOUT terraform:                       + Condition = {
08:10:29.343 STDOUT terraform:                           + ArnLike = {
08:10:29.343 STDOUT terraform:                               + "aws:SourceArn" = "arn:aws:eks:eu-west-1:955769636964:fargateprofile/sbx-dev-eu-west-1-cluster-01-infra-01/*"
08:10:29.343 STDOUT terraform:                             }
08:10:29.343 STDOUT terraform:                         }
08:10:29.343 STDOUT terraform:                       + Effect    = "Allow"
08:10:29.343 STDOUT terraform:                       + Principal = {
08:10:29.343 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
08:10:29.343 STDOUT terraform:                         }
08:10:29.343 STDOUT terraform:                     },
08:10:29.343 STDOUT terraform:                 ]
08:10:29.343 STDOUT terraform:               + Version   = "2012-10-17"
08:10:29.343 STDOUT terraform:             }
08:10:29.343 STDOUT terraform:         )
08:10:29.343 STDOUT terraform:       + create_date           = (known after apply)
08:10:29.343 STDOUT terraform:       + force_detach_policies = true
08:10:29.343 STDOUT terraform:       + id                    = (known after apply)
08:10:29.343 STDOUT terraform:       + managed_policy_arns   = (known after apply)
08:10:29.343 STDOUT terraform:       + max_session_duration  = 3600
08:10:29.343 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
08:10:29.344 STDOUT terraform:       + name_prefix           = (known after apply)
08:10:29.344 STDOUT terraform:       + path                  = "/"
08:10:29.344 STDOUT terraform:       + tags                  = {
08:10:29.344 STDOUT terraform:           + "Environment" = "dev"
08:10:29.344 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.344 STDOUT terraform:         }
08:10:29.344 STDOUT terraform:       + tags_all              = {
08:10:29.344 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.344 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.344 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.344 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.344 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.344 STDOUT terraform:         }
08:10:29.344 STDOUT terraform:       + unique_id             = (known after apply)
08:10:29.344 STDOUT terraform:       + inline_policy (known after apply)
08:10:29.344 STDOUT terraform:     }
08:10:29.344 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.additional["AmazonEKSFargatePodExecutionRolePolicy"] will be created
08:10:29.344 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.344 STDOUT terraform:       + id         = (known after apply)
08:10:29.344 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
08:10:29.344 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
08:10:29.344 STDOUT terraform:     }
08:10:29.344 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKSFargatePodExecutionRolePolicy"] will be created
08:10:29.344 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.344 STDOUT terraform:       + id         = (known after apply)
08:10:29.344 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
08:10:29.344 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
08:10:29.344 STDOUT terraform:     }
08:10:29.344 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
08:10:29.345 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.345 STDOUT terraform:       + id         = (known after apply)
08:10:29.345 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
08:10:29.345 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
08:10:29.345 STDOUT terraform:     }
08:10:29.345 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket.this[0] will be created
08:10:29.345 STDOUT terraform:   + resource "aws_s3_bucket" "this" {
08:10:29.345 STDOUT terraform:       + acceleration_status         = (known after apply)
08:10:29.345 STDOUT terraform:       + acl                         = (known after apply)
08:10:29.345 STDOUT terraform:       + arn                         = (known after apply)
08:10:29.345 STDOUT terraform:       + bucket                      = "sbx-dev-eu-west-1-ingress-alb-access-logs"
08:10:29.345 STDOUT terraform:       + bucket_domain_name          = (known after apply)
08:10:29.345 STDOUT terraform:       + bucket_prefix               = (known after apply)
08:10:29.345 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
08:10:29.345 STDOUT terraform:       + force_destroy               = false
08:10:29.345 STDOUT terraform:       + hosted_zone_id              = (known after apply)
08:10:29.345 STDOUT terraform:       + id                          = (known after apply)
08:10:29.345 STDOUT terraform:       + object_lock_enabled         = false
08:10:29.345 STDOUT terraform:       + policy                      = (known after apply)
08:10:29.345 STDOUT terraform:       + region                      = (known after apply)
08:10:29.345 STDOUT terraform:       + request_payer               = (known after apply)
08:10:29.345 STDOUT terraform:       + tags_all                    = {
08:10:29.345 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.345 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.345 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.345 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.345 STDOUT terraform:         }
08:10:29.345 STDOUT terraform:       + website_domain              = (known after apply)
08:10:29.345 STDOUT terraform:       + website_endpoint            = (known after apply)
08:10:29.345 STDOUT terraform:       + cors_rule (known after apply)
08:10:29.345 STDOUT terraform:       + grant (known after apply)
08:10:29.345 STDOUT terraform:       + lifecycle_rule (known after apply)
08:10:29.345 STDOUT terraform:       + logging (known after apply)
08:10:29.345 STDOUT terraform:       + object_lock_configuration (known after apply)
08:10:29.345 STDOUT terraform:       + replication_configuration (known after apply)
08:10:29.346 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
08:10:29.346 STDOUT terraform:       + versioning (known after apply)
08:10:29.346 STDOUT terraform:       + website (known after apply)
08:10:29.346 STDOUT terraform:     }
08:10:29.346 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_acl.this[0] will be created
08:10:29.346 STDOUT terraform:   + resource "aws_s3_bucket_acl" "this" {
08:10:29.346 STDOUT terraform:       + acl    = "private"
08:10:29.346 STDOUT terraform:       + bucket = (known after apply)
08:10:29.346 STDOUT terraform:       + id     = (known after apply)
08:10:29.346 STDOUT terraform:       + access_control_policy (known after apply)
08:10:29.346 STDOUT terraform:     }
08:10:29.346 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_ownership_controls.this[0] will be created
08:10:29.346 STDOUT terraform:   + resource "aws_s3_bucket_ownership_controls" "this" {
08:10:29.346 STDOUT terraform:       + bucket = (known after apply)
08:10:29.346 STDOUT terraform:       + id     = (known after apply)
08:10:29.346 STDOUT terraform:       + rule {
08:10:29.346 STDOUT terraform:           + object_ownership = "ObjectWriter"
08:10:29.346 STDOUT terraform:         }
08:10:29.346 STDOUT terraform:     }
08:10:29.346 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_public_access_block.this[0] will be created
08:10:29.346 STDOUT terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
08:10:29.346 STDOUT terraform:       + block_public_acls       = true
08:10:29.346 STDOUT terraform:       + block_public_policy     = true
08:10:29.346 STDOUT terraform:       + bucket                  = (known after apply)
08:10:29.346 STDOUT terraform:       + id                      = (known after apply)
08:10:29.346 STDOUT terraform:       + ignore_public_acls      = true
08:10:29.346 STDOUT terraform:       + restrict_public_buckets = true
08:10:29.346 STDOUT terraform:     }
08:10:29.346 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
08:10:29.346 STDOUT terraform:   + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
08:10:29.346 STDOUT terraform:       + bucket = (known after apply)
08:10:29.346 STDOUT terraform:       + id     = (known after apply)
08:10:29.346 STDOUT terraform:       + rule {
08:10:29.346 STDOUT terraform:           + apply_server_side_encryption_by_default {
08:10:29.346 STDOUT terraform:               + sse_algorithm     = "AES256"
08:10:29.346 STDOUT terraform:                 # (1 unchanged attribute hidden)
08:10:29.346 STDOUT terraform:             }
08:10:29.347 STDOUT terraform:         }
08:10:29.347 STDOUT terraform:     }
08:10:29.347 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_versioning.this[0] will be created
08:10:29.347 STDOUT terraform:   + resource "aws_s3_bucket_versioning" "this" {
08:10:29.347 STDOUT terraform:       + bucket = (known after apply)
08:10:29.347 STDOUT terraform:       + id     = (known after apply)
08:10:29.347 STDOUT terraform:       + versioning_configuration {
08:10:29.347 STDOUT terraform:           + mfa_delete = (known after apply)
08:10:29.347 STDOUT terraform:           + status     = "Enabled"
08:10:29.347 STDOUT terraform:         }
08:10:29.347 STDOUT terraform:     }
08:10:29.347 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["airflow"].aws_s3_object.this[0] will be created
08:10:29.347 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.347 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.347 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.347 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.347 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.347 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.347 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.347 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.347 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.347 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.347 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.347 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.347 STDOUT terraform:       + force_destroy          = false
08:10:29.347 STDOUT terraform:       + id                     = (known after apply)
08:10:29.347 STDOUT terraform:       + key                    = "airflow/.logskeeper"
08:10:29.347 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.347 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.347 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.347 STDOUT terraform:       + tags_all               = {
08:10:29.347 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.347 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.347 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.347 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.347 STDOUT terraform:         }
08:10:29.347 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.347 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.347 STDOUT terraform:     }
08:10:29.347 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["alertmanager"].aws_s3_object.this[0] will be created
08:10:29.348 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.348 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.348 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.348 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.348 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.348 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.348 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.348 STDOUT terraform:       + force_destroy          = false
08:10:29.348 STDOUT terraform:       + id                     = (known after apply)
08:10:29.348 STDOUT terraform:       + key                    = "alertmanager/.logskeeper"
08:10:29.348 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.348 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.348 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.348 STDOUT terraform:       + tags_all               = {
08:10:29.348 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.348 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.348 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.348 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.348 STDOUT terraform:         }
08:10:29.348 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.348 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.348 STDOUT terraform:     }
08:10:29.348 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo"].aws_s3_object.this[0] will be created
08:10:29.348 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.348 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.348 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.348 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.348 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.348 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.349 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.349 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.349 STDOUT terraform:       + force_destroy          = false
08:10:29.349 STDOUT terraform:       + id                     = (known after apply)
08:10:29.349 STDOUT terraform:       + key                    = "argo/.logskeeper"
08:10:29.349 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.349 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.349 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.349 STDOUT terraform:       + tags_all               = {
08:10:29.349 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.349 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.349 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.349 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.349 STDOUT terraform:         }
08:10:29.349 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.349 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.349 STDOUT terraform:     }
08:10:29.349 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-events"].aws_s3_object.this[0] will be created
08:10:29.349 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.349 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.349 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.349 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.349 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.349 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.349 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.349 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.349 STDOUT terraform:       + force_destroy          = false
08:10:29.349 STDOUT terraform:       + id                     = (known after apply)
08:10:29.349 STDOUT terraform:       + key                    = "argo-events/.logskeeper"
08:10:29.349 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.349 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.350 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.350 STDOUT terraform:       + tags_all               = {
08:10:29.350 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.350 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.350 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.350 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.350 STDOUT terraform:         }
08:10:29.350 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.350 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.350 STDOUT terraform:     }
08:10:29.350 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-rollouts"].aws_s3_object.this[0] will be created
08:10:29.350 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.350 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.350 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.350 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.350 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.350 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.350 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.350 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.350 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.350 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.350 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.350 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.350 STDOUT terraform:       + force_destroy          = false
08:10:29.350 STDOUT terraform:       + id                     = (known after apply)
08:10:29.350 STDOUT terraform:       + key                    = "argo-rollouts/.logskeeper"
08:10:29.350 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.350 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.350 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.350 STDOUT terraform:       + tags_all               = {
08:10:29.350 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.350 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.350 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.350 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.350 STDOUT terraform:         }
08:10:29.350 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.350 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.350 STDOUT terraform:     }
08:10:29.350 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-rollouts-demo"].aws_s3_object.this[0] will be created
08:10:29.351 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.351 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.351 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.351 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.351 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.351 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.351 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.351 STDOUT terraform:       + force_destroy          = false
08:10:29.351 STDOUT terraform:       + id                     = (known after apply)
08:10:29.351 STDOUT terraform:       + key                    = "argo-rollouts-demo/.logskeeper"
08:10:29.351 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.351 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.351 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.351 STDOUT terraform:       + tags_all               = {
08:10:29.351 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.351 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.351 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.351 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.351 STDOUT terraform:         }
08:10:29.351 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.351 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.351 STDOUT terraform:     }
08:10:29.351 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-workflows"].aws_s3_object.this[0] will be created
08:10:29.351 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.351 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.351 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.351 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.351 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.351 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.352 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.352 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.352 STDOUT terraform:       + force_destroy          = false
08:10:29.352 STDOUT terraform:       + id                     = (known after apply)
08:10:29.352 STDOUT terraform:       + key                    = "argo-workflows/.logskeeper"
08:10:29.352 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.352 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.352 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.352 STDOUT terraform:       + tags_all               = {
08:10:29.352 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.352 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.352 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.352 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.352 STDOUT terraform:         }
08:10:29.352 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.352 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.352 STDOUT terraform:     }
08:10:29.352 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argocd"].aws_s3_object.this[0] will be created
08:10:29.352 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.352 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.352 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.352 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.352 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.352 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.352 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.352 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.352 STDOUT terraform:       + force_destroy          = false
08:10:29.352 STDOUT terraform:       + id                     = (known after apply)
08:10:29.352 STDOUT terraform:       + key                    = "argocd/.logskeeper"
08:10:29.352 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.352 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.352 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.352 STDOUT terraform:       + tags_all               = {
08:10:29.352 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.352 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.352 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.353 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.353 STDOUT terraform:         }
08:10:29.353 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.353 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.353 STDOUT terraform:     }
08:10:29.353 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["elasticsearch"].aws_s3_object.this[0] will be created
08:10:29.353 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.353 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.353 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.353 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.353 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.353 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.353 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.353 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.353 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.353 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.353 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.353 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.353 STDOUT terraform:       + force_destroy          = false
08:10:29.353 STDOUT terraform:       + id                     = (known after apply)
08:10:29.353 STDOUT terraform:       + key                    = "elasticsearch/.logskeeper"
08:10:29.353 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.353 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.353 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.353 STDOUT terraform:       + tags_all               = {
08:10:29.353 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.353 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.353 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.353 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.353 STDOUT terraform:         }
08:10:29.353 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.353 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.353 STDOUT terraform:     }
08:10:29.353 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["goldilocks"].aws_s3_object.this[0] will be created
08:10:29.353 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.353 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.353 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.353 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.354 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.354 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.354 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.354 STDOUT terraform:       + force_destroy          = false
08:10:29.354 STDOUT terraform:       + id                     = (known after apply)
08:10:29.354 STDOUT terraform:       + key                    = "goldilocks/.logskeeper"
08:10:29.354 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.354 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.354 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.354 STDOUT terraform:       + tags_all               = {
08:10:29.354 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.354 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.354 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.354 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.354 STDOUT terraform:         }
08:10:29.354 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.354 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.354 STDOUT terraform:     }
08:10:29.354 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["grafana"].aws_s3_object.this[0] will be created
08:10:29.354 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.354 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.354 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.354 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.354 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.354 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.354 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.354 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.354 STDOUT terraform:       + force_destroy          = false
08:10:29.354 STDOUT terraform:       + id                     = (known after apply)
08:10:29.354 STDOUT terraform:       + key                    = "grafana/.logskeeper"
08:10:29.355 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.355 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.355 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.355 STDOUT terraform:       + tags_all               = {
08:10:29.355 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.355 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.355 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.355 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.355 STDOUT terraform:         }
08:10:29.355 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.355 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.355 STDOUT terraform:     }
08:10:29.355 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jaeger"].aws_s3_object.this[0] will be created
08:10:29.355 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.355 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.355 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.355 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.355 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.355 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.355 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.355 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.355 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.355 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.355 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.355 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.355 STDOUT terraform:       + force_destroy          = false
08:10:29.355 STDOUT terraform:       + id                     = (known after apply)
08:10:29.355 STDOUT terraform:       + key                    = "jaeger/.logskeeper"
08:10:29.355 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.355 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.355 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.355 STDOUT terraform:       + tags_all               = {
08:10:29.355 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.355 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.355 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.355 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.355 STDOUT terraform:         }
08:10:29.355 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.355 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.355 STDOUT terraform:     }
08:10:29.355 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jaeger_demo"].aws_s3_object.this[0] will be created
08:10:29.356 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.356 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.356 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.356 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.356 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.356 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.356 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.356 STDOUT terraform:       + force_destroy          = false
08:10:29.356 STDOUT terraform:       + id                     = (known after apply)
08:10:29.356 STDOUT terraform:       + key                    = "jaeger-demo/.logskeeper"
08:10:29.356 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.356 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.356 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.356 STDOUT terraform:       + tags_all               = {
08:10:29.356 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.356 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.356 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.356 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.356 STDOUT terraform:         }
08:10:29.356 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.356 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.356 STDOUT terraform:     }
08:10:29.356 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jenkins"].aws_s3_object.this[0] will be created
08:10:29.356 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.356 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.356 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.356 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.356 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.356 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.357 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.357 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.357 STDOUT terraform:       + force_destroy          = false
08:10:29.357 STDOUT terraform:       + id                     = (known after apply)
08:10:29.357 STDOUT terraform:       + key                    = "jenkins/.logskeeper"
08:10:29.357 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.357 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.357 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.357 STDOUT terraform:       + tags_all               = {
08:10:29.357 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.357 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.357 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.357 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.357 STDOUT terraform:         }
08:10:29.357 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.357 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.357 STDOUT terraform:     }
08:10:29.357 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["kibana"].aws_s3_object.this[0] will be created
08:10:29.357 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.357 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.357 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.357 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.357 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.357 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.357 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.357 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.357 STDOUT terraform:       + force_destroy          = false
08:10:29.357 STDOUT terraform:       + id                     = (known after apply)
08:10:29.357 STDOUT terraform:       + key                    = "kibana/.logskeeper"
08:10:29.357 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.357 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.357 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.357 STDOUT terraform:       + tags_all               = {
08:10:29.357 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.357 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.357 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.358 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.358 STDOUT terraform:         }
08:10:29.358 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.358 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.358 STDOUT terraform:     }
08:10:29.358 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["kubeshark"].aws_s3_object.this[0] will be created
08:10:29.358 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.358 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.358 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.358 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.358 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.358 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.358 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.358 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.358 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.358 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.358 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.358 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.358 STDOUT terraform:       + force_destroy          = false
08:10:29.358 STDOUT terraform:       + id                     = (known after apply)
08:10:29.358 STDOUT terraform:       + key                    = "kubeshark/.logskeeper"
08:10:29.358 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.358 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.358 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.358 STDOUT terraform:       + tags_all               = {
08:10:29.358 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.358 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.358 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.358 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.358 STDOUT terraform:         }
08:10:29.358 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.358 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.358 STDOUT terraform:     }
08:10:29.358 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["loki-stack"].aws_s3_object.this[0] will be created
08:10:29.358 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.358 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.358 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.358 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.358 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.359 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.359 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.359 STDOUT terraform:       + force_destroy          = false
08:10:29.359 STDOUT terraform:       + id                     = (known after apply)
08:10:29.359 STDOUT terraform:       + key                    = "loki-stack/.logskeeper"
08:10:29.359 STDOUT terraform:       + kms_key_id             = (known after apply)
08:10:29.359 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.359 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.359 STDOUT terraform:       + tags_all               = {
08:10:29.359 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.359 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.359 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.359 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.359 STDOUT terraform:         }
08:10:29.359 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.359 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.359 STDOUT terraform:     }
08:10:29.359 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["prometheus"].aws_s3_object.this[0] will be created
08:10:29.359 STDOUT terraform:   + resource "aws_s3_object" "this" {
08:10:29.359 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
08:10:29.359 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.359 STDOUT terraform:       + bucket                 = (known after apply)
08:10:29.359 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc32         = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc32c        = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_sha1          = (known after apply)
08:10:29.359 STDOUT terraform:       + checksum_sha256        = (known after apply)
08:10:29.359 STDOUT terraform:       + content_type           = "text/plain"
08:10:29.359 STDOUT terraform:       + etag                   = (known after apply)
08:10:29.359 STDOUT terraform:       + force_destroy          = false
08:10:29.359 STDOUT terraform:       + id                     = (known after apply)
08:10:29.359 STDOUT terraform:       + key                    = "prometheus/.logskeeper"
08:10:29.359 STDOUT terraform:    
08:10:29.360 STDOUT terraform:    + kms_key_id             = (known after apply)
08:10:29.360 STDOUT terraform:       + server_side_encryption = (known after apply)
08:10:29.360 STDOUT terraform:       + storage_class          = (known after apply)
08:10:29.360 STDOUT terraform:       + tags_all               = {
08:10:29.360 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.360 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.360 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.360 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.360 STDOUT terraform:         }
08:10:29.360 STDOUT terraform:       + version_id             = (known after apply)
08:10:29.360 STDOUT terraform:         # (1 unchanged attribute hidden)
08:10:29.360 STDOUT terraform:     }
08:10:29.360 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.additional_policy.aws_iam_policy.policy[0] will be created
08:10:29.360 STDOUT terraform:   + resource "aws_iam_policy" "policy" {
08:10:29.360 STDOUT terraform:       + arn              = (known after apply)
08:10:29.360 STDOUT terraform:       + attachment_count = (known after apply)
08:10:29.360 STDOUT terraform:       + description      = "Additional policy for eks node group"
08:10:29.360 STDOUT terraform:       + id               = (known after apply)
08:10:29.360 STDOUT terraform:       + name             = (known after apply)
08:10:29.360 STDOUT terraform:       + name_prefix      = (known after apply)
08:10:29.360 STDOUT terraform:       + path             = "/"
08:10:29.360 STDOUT terraform:       + policy           = (known after apply)
08:10:29.360 STDOUT terraform:       + policy_id        = (known after apply)
08:10:29.360 STDOUT terraform:       + tags             = {
08:10:29.360 STDOUT terraform:           + "PolicyDescription" = "Policy created using example from data source"
08:10:29.360 STDOUT terraform:         }
08:10:29.360 STDOUT terraform:       + tags_all         = {
08:10:29.360 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.360 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.360 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.360 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.360 STDOUT terraform:           + "PolicyDescription"   = "Policy created using example from data source"
08:10:29.360 STDOUT terraform:         }
08:10:29.360 STDOUT terraform:     }
08:10:29.360 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_caller_identity.current will be read during apply
08:10:29.360 STDOUT terraform:   # (depends on a resource or a module with changes pending)
08:10:29.360 STDOUT terraform:  <= data "aws_caller_identity" "current" {
08:10:29.360 STDOUT terraform:       + account_id = (known after apply)
08:10:29.360 STDOUT terraform:       + arn        = (known after apply)
08:10:29.360 STDOUT terraform:       + id         = (known after apply)
08:10:29.360 STDOUT terraform:       + user_id    = (known after apply)
08:10:29.360 STDOUT terraform:     }
08:10:29.361 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
08:10:29.361 STDOUT terraform:   # (depends on a resource or a module with changes pending)
08:10:29.361 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy" {
08:10:29.361 STDOUT terraform:       + id            = (known after apply)
08:10:29.361 STDOUT terraform:       + json          = (known after apply)
08:10:29.361 STDOUT terraform:       + minified_json = (known after apply)
08:10:29.361 STDOUT terraform:       + statement {
08:10:29.361 STDOUT terraform:           + actions = [
08:10:29.361 STDOUT terraform:               + "sts:AssumeRole",
08:10:29.361 STDOUT terraform:             ]
08:10:29.361 STDOUT terraform:           + sid     = "EKSNodeAssumeRole"
08:10:29.361 STDOUT terraform:           + principals {
08:10:29.361 STDOUT terraform:               + identifiers = [
08:10:29.361 STDOUT terraform:                   + "ec2.amazonaws.com",
08:10:29.361 STDOUT terraform:                 ]
08:10:29.361 STDOUT terraform:               + type        = "Service"
08:10:29.361 STDOUT terraform:             }
08:10:29.361 STDOUT terraform:         }
08:10:29.361 STDOUT terraform:     }
08:10:29.361 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_partition.current will be read during apply
08:10:29.361 STDOUT terraform:   # (depends on a resource or a module with changes pending)
08:10:29.361 STDOUT terraform:  <= data "aws_partition" "current" {
08:10:29.361 STDOUT terraform:       + dns_suffix         = (known after apply)
08:10:29.361 STDOUT terraform:       + id                 = (known after apply)
08:10:29.361 STDOUT terraform:       + partition          = (known after apply)
08:10:29.361 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
08:10:29.361 STDOUT terraform:     }
08:10:29.361 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_eks_node_group.this[0] will be created
08:10:29.361 STDOUT terraform:   + resource "aws_eks_node_group" "this" {
08:10:29.361 STDOUT terraform:       + ami_type               = "AL2_x86_64"
08:10:29.361 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.361 STDOUT terraform:       + capacity_type          = "ON_DEMAND"
08:10:29.361 STDOUT terraform:       + cluster_name           = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.361 STDOUT terraform:       + disk_size              = (known after apply)
08:10:29.361 STDOUT terraform:       + id                     = (known after apply)
08:10:29.361 STDOUT terraform:       + instance_types         = [
08:10:29.361 STDOUT terraform:           + "m7i.4xlarge",
08:10:29.361 STDOUT terraform:         ]
08:10:29.361 STDOUT terraform:       + node_group_name        = (known after apply)
08:10:29.361 STDOUT terraform:       + node_group_name_prefix = "my-app-eks-x86-"
08:10:29.361 STDOUT terraform:       + node_role_arn          = (known after apply)
08:10:29.362 STDOUT terraform:       + release_version        = (known after apply)
08:10:29.362 STDOUT terraform:       + resources              = (known after apply)
08:10:29.362 STDOUT terraform:       + status                 = (known after apply)
08:10:29.362 STDOUT terraform:       + subnet_ids             = [
08:10:29.362 STDOUT terraform:           + "subnet-1",
08:10:29.362 STDOUT terraform:           + "subnet-2",
08:10:29.362 STDOUT terraform:           + "subnet-3",
08:10:29.362 STDOUT terraform:         ]
08:10:29.362 STDOUT terraform:       + tags                   = {
08:10:29.362 STDOUT terraform:           + "Environment" = "dev"
08:10:29.362 STDOUT terraform:           + "Name"        = "my-app-eks-x86"
08:10:29.362 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.362 STDOUT terraform:         }
08:10:29.362 STDOUT terraform:       + tags_all               = {
08:10:29.362 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.362 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.362 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.362 STDOUT terraform:           + "Name"                = "my-app-eks-x86"
08:10:29.362 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.362 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.362 STDOUT terraform:         }
08:10:29.362 STDOUT terraform:       + version                = "1.31"
08:10:29.362 STDOUT terraform:       + launch_template {
08:10:29.362 STDOUT terraform:           + id      = (known after apply)
08:10:29.362 STDOUT terraform:           + name    = (known after apply)
08:10:29.362 STDOUT terraform:           + version = (known after apply)
08:10:29.362 STDOUT terraform:         }
08:10:29.362 STDOUT terraform:       + node_repair_config (known after apply)
08:10:29.362 STDOUT terraform:       + scaling_config {
08:10:29.362 STDOUT terraform:           + desired_size = 3
08:10:29.362 STDOUT terraform:           + max_size     = 16
08:10:29.362 STDOUT terraform:           + min_size     = 3
08:10:29.362 STDOUT terraform:         }
08:10:29.362 STDOUT terraform:       + timeouts {}
08:10:29.362 STDOUT terraform:       + update_config {
08:10:29.362 STDOUT terraform:           + max_unavailable_percentage = 33
08:10:29.362 STDOUT terraform:         }
08:10:29.362 STDOUT terraform:     }
08:10:29.362 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role.this[0] will be created
08:10:29.362 STDOUT terraform:   + resource "aws_iam_role" "this" {
08:10:29.362 STDOUT terraform:       + arn                   = (known after apply)
08:10:29.362 STDOUT terraform:       + assume_role_policy    = (known after apply)
08:10:29.362 STDOUT terraform:       + create_date           = (known after apply)
08:10:29.362 STDOUT terraform:       + force_detach_policies = true
08:10:29.362 STDOUT terraform:       + id                    = (known after apply)
08:10:29.362 STDOUT terraform:       + managed_policy_arns   = (known after apply)
08:10:29.362 STDOUT terraform:       + max_session_duration  = 3600
08:10:29.362 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.362 STDOUT terraform:       + name_prefix           = (known after apply)
08:10:29.362 STDOUT terraform:       + path                  = "/"
08:10:29.362 STDOUT terraform:       + tags                  = {
08:10:29.362 STDOUT terraform:           + "Environment" = "dev"
08:10:29.362 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.363 STDOUT terraform:         }
08:10:29.363 STDOUT terraform:       + tags_all              = {
08:10:29.363 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.363 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.363 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.363 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.363 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.363 STDOUT terraform:         }
08:10:29.363 STDOUT terraform:       + unique_id             = (known after apply)
08:10:29.363 STDOUT terraform:       + inline_policy (known after apply)
08:10:29.363 STDOUT terraform:     }
08:10:29.363 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["AmazonEC2ContainerServiceforEC2Role"] will be created
08:10:29.363 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.363 STDOUT terraform:       + id         = (known after apply)
08:10:29.363 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
08:10:29.363 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.363 STDOUT terraform:     }
08:10:29.363 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchFullAccess"] will be created
08:10:29.363 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.363 STDOUT terraform:       + id         = (known after apply)
08:10:29.363 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
08:10:29.363 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.363 STDOUT terraform:     }
08:10:29.363 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchLogsFullAccess"] will be created
08:10:29.363 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.363 STDOUT terraform:       + id         = (known after apply)
08:10:29.363 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
08:10:29.363 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.364 STDOUT terraform:     }
08:10:29.364 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["additional_policy"] will be created
08:10:29.364 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.364 STDOUT terraform:       + id         = (known after apply)
08:10:29.364 STDOUT terraform:       + policy_arn = (known after apply)
08:10:29.364 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.364 STDOUT terraform:     }
08:10:29.364 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cloudwatch_agent_policy"] will be created
08:10:29.364 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.364 STDOUT terraform:       + id         = (known after apply)
08:10:29.364 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
08:10:29.364 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.364 STDOUT terraform:     }
08:10:29.364 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cni_policy"] will be created
08:10:29.364 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.364 STDOUT terraform:       + id         = (known after apply)
08:10:29.364 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
08:10:29.364 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.364 STDOUT terraform:     }
08:10:29.364 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["ssm_managed_instance_core_policy"] will be created
08:10:29.364 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.364 STDOUT terraform:       + id         = (known after apply)
08:10:29.364 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
08:10:29.365 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.365 STDOUT terraform:     }
08:10:29.365 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["vpc_resource_controller_policy"] will be created
08:10:29.365 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.365 STDOUT terraform:       + id         = (known after apply)
08:10:29.365 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
08:10:29.365 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.365 STDOUT terraform:     }
08:10:29.365 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["worker_node_policy"] will be created
08:10:29.365 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
08:10:29.365 STDOUT terraform:       + id         = (known after apply)
08:10:29.365 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
08:10:29.365 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.365 STDOUT terraform:     }
08:10:29.365 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
08:10:29.365 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.365 STDOUT terraform:       + id         = (known after apply)
08:10:29.365 STDOUT terraform:       + policy_arn = (known after apply)
08:10:29.365 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.365 STDOUT terraform:     }
08:10:29.365 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
08:10:29.365 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.366 STDOUT terraform:       + id         = (known after apply)
08:10:29.366 STDOUT terraform:       + policy_arn = (known after apply)
08:10:29.366 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.366 STDOUT terraform:     }
08:10:29.366 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
08:10:29.366 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
08:10:29.366 STDOUT terraform:       + id         = (known after apply)
08:10:29.366 STDOUT terraform:       + policy_arn = (known after apply)
08:10:29.366 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
08:10:29.366 STDOUT terraform:     }
08:10:29.366 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_launch_template.this[0] will be created
08:10:29.366 STDOUT terraform:   + resource "aws_launch_template" "this" {
08:10:29.366 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.366 STDOUT terraform:       + default_version        = (known after apply)
08:10:29.366 STDOUT terraform:       + id                     = (known after apply)
08:10:29.366 STDOUT terraform:       + latest_version         = (known after apply)
08:10:29.366 STDOUT terraform:       + name                   = (known after apply)
08:10:29.366 STDOUT terraform:       + name_prefix            = "my-app-eks-x86-eks-node-group-"
08:10:29.366 STDOUT terraform:       + tags                   = {
08:10:29.366 STDOUT terraform:           + "Environment" = "dev"
08:10:29.366 STDOUT terraform:           + "Terragrunt"  = "true"
08:10:29.366 STDOUT terraform:         }
08:10:29.366 STDOUT terraform:       + tags_all               = {
08:10:29.366 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.366 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.366 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.366 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.366 STDOUT terraform:           + "Terragrunt"          = "true"
08:10:29.366 STDOUT terraform:         }
08:10:29.366 STDOUT terraform:       + update_default_version = true
08:10:29.366 STDOUT terraform:         # (2 unchanged attributes hidden)
08:10:29.366 STDOUT terraform:       + block_device_mappings {
08:10:29.366 STDOUT terraform:           + device_name = "/dev/xvda"
08:10:29.366 STDOUT terraform:           + ebs (known after apply)
08:10:29.366 STDOUT terraform:         }
08:10:29.366 STDOUT terraform:       + metadata_options {
08:10:29.366 STDOUT terraform:           + http_endpoint               = "enabled"
08:10:29.366 STDOUT terraform:           + http_protocol_ipv6          = (known after apply)
08:10:29.366 STDOUT terraform:           + http_put_response_hop_limit = 2
08:10:29.366 STDOUT terraform:           + http_tokens                 = "required"
08:10:29.367 STDOUT terraform:           + instance_metadata_tags      = "enabled"
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:       + monitoring {
08:10:29.367 STDOUT terraform:           + enabled = true
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:       + network_interfaces {
08:10:29.367 STDOUT terraform:           + associate_public_ip_address = "true"
08:10:29.367 STDOUT terraform:           + delete_on_termination       = "true"
08:10:29.367 STDOUT terraform:           + security_groups             = (known after apply)
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:       + tag_specifications {
08:10:29.367 STDOUT terraform:           + resource_type = "instance"
08:10:29.367 STDOUT terraform:           + tags          = {
08:10:29.367 STDOUT terraform:               + "Environment" = "dev"
08:10:29.367 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
08:10:29.367 STDOUT terraform:               + "Terragrunt"  = "true"
08:10:29.367 STDOUT terraform:             }
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:       + tag_specifications {
08:10:29.367 STDOUT terraform:           + resource_type = "network-interface"
08:10:29.367 STDOUT terraform:           + tags          = {
08:10:29.367 STDOUT terraform:               + "Environment" = "dev"
08:10:29.367 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
08:10:29.367 STDOUT terraform:               + "Terragrunt"  = "true"
08:10:29.367 STDOUT terraform:             }
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:       + tag_specifications {
08:10:29.367 STDOUT terraform:           + resource_type = "volume"
08:10:29.367 STDOUT terraform:           + tags          = {
08:10:29.367 STDOUT terraform:               + "Environment" = "dev"
08:10:29.367 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
08:10:29.367 STDOUT terraform:               + "Terragrunt"  = "true"
08:10:29.367 STDOUT terraform:             }
08:10:29.367 STDOUT terraform:         }
08:10:29.367 STDOUT terraform:     }
08:10:29.367 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group.this_name_prefix[0] will be created
08:10:29.367 STDOUT terraform:   + resource "aws_security_group" "this_name_prefix" {
08:10:29.367 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.367 STDOUT terraform:       + description            = "Security group for ALB ingress"
08:10:29.367 STDOUT terraform:       + egress                 = (known after apply)
08:10:29.367 STDOUT terraform:       + id                     = (known after apply)
08:10:29.367 STDOUT terraform:       + ingress                = (known after apply)
08:10:29.367 STDOUT terraform:       + name                   = (known after apply)
08:10:29.367 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964-"
08:10:29.367 STDOUT terraform:       + owner_id               = (known after apply)
08:10:29.367 STDOUT terraform:       + revoke_rules_on_delete = false
08:10:29.367 STDOUT terraform:       + tags                   = {
08:10:29.367 STDOUT terraform:           + "Name"         = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964"
08:10:29.367 STDOUT terraform:           + "worker-nodes" = "worker-nodes"
08:10:29.368 STDOUT terraform:         }
08:10:29.368 STDOUT terraform:       + tags_all               = {
08:10:29.368 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.368 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.368 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.368 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964"
08:10:29.368 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.368 STDOUT terraform:           + "worker-nodes"        = "worker-nodes"
08:10:29.368 STDOUT terraform:         }
08:10:29.368 STDOUT terraform:       + vpc_id                 = "vpc-1234"
08:10:29.368 STDOUT terraform:       + timeouts {
08:10:29.368 STDOUT terraform:           + create = "15m"
08:10:29.368 STDOUT terraform:           + delete = "45m"
08:10:29.368 STDOUT terraform:         }
08:10:29.368 STDOUT terraform:     }
08:10:29.368 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
08:10:29.368 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
08:10:29.368 STDOUT terraform:       + cidr_blocks              = [
08:10:29.368 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.368 STDOUT terraform:         ]
08:10:29.368 STDOUT terraform:       + description              = "Allow all outgoing connections to everywhere"
08:10:29.368 STDOUT terraform:       + from_port                = 0
08:10:29.368 STDOUT terraform:       + id                       = (known after apply)
08:10:29.368 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.368 STDOUT terraform:       + protocol                 = "-1"
08:10:29.368 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.368 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.368 STDOUT terraform:       + self                     = false
08:10:29.368 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.368 STDOUT terraform:       + to_port                  = 0
08:10:29.368 STDOUT terraform:       + type                     = "egress"
08:10:29.368 STDOUT terraform:     }
08:10:29.368 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
08:10:29.368 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
08:10:29.368 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.368 STDOUT terraform:       + from_port                = 0
08:10:29.368 STDOUT terraform:       + id                       = (known after apply)
08:10:29.368 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.368 STDOUT terraform:           + "::/0",
08:10:29.368 STDOUT terraform:         ]
08:10:29.368 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.369 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.369 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.369 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.369 STDOUT terraform:       + self                     = false
08:10:29.369 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.369 STDOUT terraform:       + to_port                  = 0
08:10:29.369 STDOUT terraform:       + type                     = "egress"
08:10:29.369 STDOUT terraform:     }
08:10:29.369 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
08:10:29.369 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.369 STDOUT terraform:       + cidr_blocks              = [
08:10:29.369 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.369 STDOUT terraform:         ]
08:10:29.369 STDOUT terraform:       + description              = "Allow HTTP traffic"
08:10:29.369 STDOUT terraform:       + from_port                = 80
08:10:29.369 STDOUT terraform:       + id                       = (known after apply)
08:10:29.369 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.369 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.369 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.369 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.369 STDOUT terraform:       + self                     = false
08:10:29.369 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.369 STDOUT terraform:       + to_port                  = 80
08:10:29.369 STDOUT terraform:       + type                     = "ingress"
08:10:29.369 STDOUT terraform:     }
08:10:29.369 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
08:10:29.369 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.369 STDOUT terraform:       + cidr_blocks              = [
08:10:29.369 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.369 STDOUT terraform:         ]
08:10:29.369 STDOUT terraform:       + description              = "Allow SSH traffic"
08:10:29.369 STDOUT terraform:       + from_port                = 22
08:10:29.369 STDOUT terraform:       + id                       = (known after apply)
08:10:29.369 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.369 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.369 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.369 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.369 STDOUT terraform:       + self                     = false
08:10:29.369 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.369 STDOUT terraform:       + to_port                  = 22
08:10:29.369 STDOUT terraform:       + type                     = "ingress"
08:10:29.369 STDOUT terraform:     }
08:10:29.369 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
08:10:29.370 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.370 STDOUT terraform:       + cidr_blocks              = [
08:10:29.370 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.370 STDOUT terraform:         ]
08:10:29.370 STDOUT terraform:       + description              = "Allow HTTPS traffic"
08:10:29.370 STDOUT terraform:       + from_port                = 443
08:10:29.370 STDOUT terraform:       + id                       = (known after apply)
08:10:29.370 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.370 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.370 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.370 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.370 STDOUT terraform:       + self                     = false
08:10:29.370 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.370 STDOUT terraform:       + to_port                  = 443
08:10:29.370 STDOUT terraform:       + type                     = "ingress"
08:10:29.370 STDOUT terraform:     }
08:10:29.370 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
08:10:29.370 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.370 STDOUT terraform:       + cidr_blocks              = [
08:10:29.370 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.370 STDOUT terraform:         ]
08:10:29.370 STDOUT terraform:       + description              = "Allow 8443 HTTPS traffic"
08:10:29.370 STDOUT terraform:       + from_port                = 8443
08:10:29.370 STDOUT terraform:       + id                       = (known after apply)
08:10:29.370 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.370 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.370 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.370 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.370 STDOUT terraform:       + self                     = false
08:10:29.370 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.370 STDOUT terraform:       + to_port                  = 8443
08:10:29.370 STDOUT terraform:       + type                     = "ingress"
08:10:29.370 STDOUT terraform:     }
08:10:29.370 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
08:10:29.370 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.370 STDOUT terraform:       + cidr_blocks              = [
08:10:29.370 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.371 STDOUT terraform:         ]
08:10:29.371 STDOUT terraform:       + description              = "Allow 8080 HTTP traffic"
08:10:29.371 STDOUT terraform:       + from_port                = 8080
08:10:29.371 STDOUT terraform:       + id                       = (known after apply)
08:10:29.371 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.371 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.371 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.371 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.371 STDOUT terraform:       + self                     = false
08:10:29.371 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.371 STDOUT terraform:       + to_port                  = 8080
08:10:29.371 STDOUT terraform:       + type                     = "ingress"
08:10:29.371 STDOUT terraform:     }
08:10:29.371 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
08:10:29.371 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
08:10:29.371 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.371 STDOUT terraform:       + from_port                = 80
08:10:29.371 STDOUT terraform:       + id                       = (known after apply)
08:10:29.371 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.371 STDOUT terraform:           + "::/0",
08:10:29.371 STDOUT terraform:         ]
08:10:29.371 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.371 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.371 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.371 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.371 STDOUT terraform:       + self                     = false
08:10:29.371 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.371 STDOUT terraform:       + to_port                  = 80
08:10:29.371 STDOUT terraform:       + type                     = "ingress"
08:10:29.371 STDOUT terraform:     }
08:10:29.371 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
08:10:29.371 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
08:10:29.371 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.371 STDOUT terraform:       + from_port                = 443
08:10:29.371 STDOUT terraform:       + id                       = (known after apply)
08:10:29.371 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.371 STDOUT terraform:           + "::/0",
08:10:29.371 STDOUT terraform:         ]
08:10:29.371 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.371 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.371 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.372 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.372 STDOUT terraform:       + self                     = false
08:10:29.372 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.372 STDOUT terraform:       + to_port                  = 443
08:10:29.372 STDOUT terraform:       + type                     = "ingress"
08:10:29.372 STDOUT terraform:     }
08:10:29.372 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[2] will be created
08:10:29.372 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
08:10:29.372 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.372 STDOUT terraform:       + from_port                = 8443
08:10:29.372 STDOUT terraform:       + id                       = (known after apply)
08:10:29.372 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.372 STDOUT terraform:           + "::/0",
08:10:29.372 STDOUT terraform:         ]
08:10:29.372 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.372 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.372 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.372 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.372 STDOUT terraform:       + self                     = false
08:10:29.372 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.372 STDOUT terraform:       + to_port                  = 8443
08:10:29.372 STDOUT terraform:       + type                     = "ingress"
08:10:29.372 STDOUT terraform:     }
08:10:29.372 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[3] will be created
08:10:29.372 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
08:10:29.372 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.372 STDOUT terraform:       + from_port                = 8080
08:10:29.372 STDOUT terraform:       + id                       = (known after apply)
08:10:29.372 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.372 STDOUT terraform:           + "::/0",
08:10:29.372 STDOUT terraform:         ]
08:10:29.372 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.372 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.372 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.372 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.372 STDOUT terraform:       + self                     = false
08:10:29.372 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.372 STDOUT terraform:       + to_port                  = 8080
08:10:29.372 STDOUT terraform:       + type                     = "ingress"
08:10:29.372 STDOUT terraform:     }
08:10:29.372 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_self[0] will be created
08:10:29.373 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_self" {
08:10:29.373 STDOUT terraform:       + description              = "Allow all incoming connections from this security group"
08:10:29.373 STDOUT terraform:       + from_port                = -1
08:10:29.373 STDOUT terraform:       + id                       = (known after apply)
08:10:29.373 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.373 STDOUT terraform:       + protocol                 = "0"
08:10:29.373 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.373 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.373 STDOUT terraform:       + self                     = true
08:10:29.373 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.373 STDOUT terraform:       + to_port                  = 0
08:10:29.373 STDOUT terraform:       + type                     = "ingress"
08:10:29.373 STDOUT terraform:     }
08:10:29.373 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group.this_name_prefix[0] will be created
08:10:29.373 STDOUT terraform:   + resource "aws_security_group" "this_name_prefix" {
08:10:29.373 STDOUT terraform:       + arn                    = (known after apply)
08:10:29.373 STDOUT terraform:       + description            = "Security group for nodes"
08:10:29.373 STDOUT terraform:       + egress                 = (known after apply)
08:10:29.373 STDOUT terraform:       + id                     = (known after apply)
08:10:29.373 STDOUT terraform:       + ingress                = (known after apply)
08:10:29.373 STDOUT terraform:       + name                   = (known after apply)
08:10:29.373 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-extra-node-sg-955769636964-"
08:10:29.373 STDOUT terraform:       + owner_id               = (known after apply)
08:10:29.373 STDOUT terraform:       + revoke_rules_on_delete = false
08:10:29.373 STDOUT terraform:       + tags                   = {
08:10:29.373 STDOUT terraform:           + "Name"         = "sbx-dev-eu-west-1-extra-node-sg-955769636964"
08:10:29.373 STDOUT terraform:           + "worker-nodes" = "worker-nodes"
08:10:29.373 STDOUT terraform:         }
08:10:29.373 STDOUT terraform:       + tags_all               = {
08:10:29.373 STDOUT terraform:           + "Data-classification" = "internal"
08:10:29.373 STDOUT terraform:           + "Environment"         = "dev"
08:10:29.373 STDOUT terraform:           + "Managed-by"          = "terragrunt"
08:10:29.373 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-extra-node-sg-955769636964"
08:10:29.373 STDOUT terraform:           + "Organization"        = "genopsx"
08:10:29.374 STDOUT terraform:           + "worker-nodes"        = "worker-nodes"
08:10:29.374 STDOUT terraform:         }
08:10:29.374 STDOUT terraform:       + vpc_id                 = "vpc-1234"
08:10:29.374 STDOUT terraform:       + timeouts {
08:10:29.374 STDOUT terraform:           + create = "15m"
08:10:29.374 STDOUT terraform:           + delete = "45m"
08:10:29.374 STDOUT terraform:         }
08:10:29.374 STDOUT terraform:     }
08:10:29.374 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
08:10:29.374 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
08:10:29.374 STDOUT terraform:       + cidr_blocks              = [
08:10:29.374 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.374 STDOUT terraform:         ]
08:10:29.374 STDOUT terraform:       + description              = "Allow all outgoing connections to everywhere"
08:10:29.374 STDOUT terraform:       + from_port                = 0
08:10:29.374 STDOUT terraform:       + id                       = (known after apply)
08:10:29.374 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.374 STDOUT terraform:       + protocol                 = "-1"
08:10:29.374 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.374 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.374 STDOUT terraform:       + self                     = false
08:10:29.374 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.374 STDOUT terraform:       + to_port                  = 0
08:10:29.374 STDOUT terraform:       + type                     = "egress"
08:10:29.374 STDOUT terraform:     }
08:10:29.374 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
08:10:29.374 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
08:10:29.374 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.374 STDOUT terraform:       + from_port                = 0
08:10:29.374 STDOUT terraform:       + id                       = (known after apply)
08:10:29.374 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.374 STDOUT terraform:           + "::/0",
08:10:29.374 STDOUT terraform:         ]
08:10:29.374 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.374 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.374 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.374 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.374 STDOUT terraform:       + self                     = false
08:10:29.374 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.374 STDOUT terraform:       + to_port                  = 0
08:10:29.374 STDOUT terraform:       + type                     = "egress"
08:10:29.374 STDOUT terraform:     }
08:10:29.375 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
08:10:29.375 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
08:10:29.375 STDOUT terraform:       + cidr_blocks              = [
08:10:29.375 STDOUT terraform:           + "0.0.0.0/0",
08:10:29.375 STDOUT terraform:         ]
08:10:29.375 STDOUT terraform:       + description              = "Allow HTTPS traffic from EKS to EKS (internal calls)"
08:10:29.375 STDOUT terraform:       + from_port                = 443
08:10:29.375 STDOUT terraform:       + id                       = (known after apply)
08:10:29.375 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.375 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.375 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.375 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.375 STDOUT terraform:       + self                     = false
08:10:29.375 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.375 STDOUT terraform:       + to_port                  = 443
08:10:29.375 STDOUT terraform:       + type                     = "ingress"
08:10:29.375 STDOUT terraform:     }
08:10:29.375 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
08:10:29.375 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
08:10:29.375 STDOUT terraform:       + description              = "Service ports (ipv6)"
08:10:29.375 STDOUT terraform:       + from_port                = 443
08:10:29.375 STDOUT terraform:       + id                       = (known after apply)
08:10:29.375 STDOUT terraform:       + ipv6_cidr_blocks         = [
08:10:29.375 STDOUT terraform:           + "::/0",
08:10:29.375 STDOUT terraform:         ]
08:10:29.375 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.375 STDOUT terraform:       + protocol                 = "tcp"
08:10:29.375 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.375 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.375 STDOUT terraform:       + self                     = false
08:10:29.375 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.375 STDOUT terraform:       + to_port                  = 443
08:10:29.375 STDOUT terraform:       + type                     = "ingress"
08:10:29.375 STDOUT terraform:     }
08:10:29.375 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_self[0] will be created
08:10:29.375 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_self" {
08:10:29.375 STDOUT terraform:       + description              = "Allow all incoming connections from this security group"
08:10:29.376 STDOUT terraform:       + from_port                = -1
08:10:29.376 STDOUT terraform:       + id                       = (known after apply)
08:10:29.376 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.376 STDOUT terraform:       + protocol                 = "0"
08:10:29.376 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.376 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.376 STDOUT terraform:       + self                     = true
08:10:29.376 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.376 STDOUT terraform:       + to_port                  = 0
08:10:29.376 STDOUT terraform:       + type                     = "ingress"
08:10:29.376 STDOUT terraform:     }
08:10:29.376 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
08:10:29.376 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
08:10:29.376 STDOUT terraform:       + description              = "Allow all incoming connections from ALB security group"
08:10:29.376 STDOUT terraform:       + from_port                = 0
08:10:29.376 STDOUT terraform:       + id                       = (known after apply)
08:10:29.376 STDOUT terraform:       + prefix_list_ids          = []
08:10:29.376 STDOUT terraform:       + protocol                 = "-1"
08:10:29.376 STDOUT terraform:       + security_group_id        = (known after apply)
08:10:29.376 STDOUT terraform:       + security_group_rule_id   = (known after apply)
08:10:29.376 STDOUT terraform:       + self                     = false
08:10:29.376 STDOUT terraform:       + source_security_group_id = (known after apply)
08:10:29.376 STDOUT terraform:       + to_port                  = 0
08:10:29.376 STDOUT terraform:       + type                     = "ingress"
08:10:29.376 STDOUT terraform:     }
08:10:29.376 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.module.user_data.null_resource.validate_cluster_service_cidr will be created
08:10:29.376 STDOUT terraform:   + resource "null_resource" "validate_cluster_service_cidr" {
08:10:29.376 STDOUT terraform:       + id = (known after apply)
08:10:29.376 STDOUT terraform:     }
08:10:29.376 STDOUT terraform: Plan: 116 to add, 0 to change, 0 to destroy.
08:10:29.376 STDOUT terraform: Changes to Outputs:
08:10:29.376 STDOUT terraform:   + acm_certificate_arn                           = (known after apply)
08:10:29.376 STDOUT terraform:   + cloudwatch_log_group_arn                      = (known after apply)
08:10:29.377 STDOUT terraform:   + cloudwatch_log_group_name                     = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
08:10:29.377 STDOUT terraform:   + clsuter_iam_role_name                         = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
08:10:29.377 STDOUT terraform:   + cluster_arn                                   = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_certificate_authority_data            = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_endpoint                              = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_iam_role_arn                          = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_id                                    = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_identity_providers                    = {}
08:10:29.377 STDOUT terraform:   + cluster_ip_family                             = "ipv4"
08:10:29.377 STDOUT terraform:   + cluster_name                                  = "sbx-dev-eu-west-1-cluster-01-infra-01"
08:10:29.377 STDOUT terraform:   + cluster_oidc_issuer_url                       = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_oidc_provider                         = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_oidc_provider_arn                     = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_platform_version                      = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_primary_security_group_id             = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_region                                = "eu-west-1"
08:10:29.377 STDOUT terraform:   + cluster_service_cidr                          = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_status                                = (known after apply)
08:10:29.377 STDOUT terraform:   + cluster_token                                 = (sensitive value)
08:10:29.377 STDOUT terraform:   + cluster_version                               = "1.31"
08:10:29.377 STDOUT terraform:   + combined_primary_and_nodes_security_group_ids = [
08:10:29.377 STDOUT terraform:       + (known after apply),
08:10:29.378 STDOUT terraform:       + (known after apply),
08:10:29.378 STDOUT terraform:     ]
08:10:29.378 STDOUT terraform:   + ingress_alb_access_logs_bucket_arn            = (known after apply)
08:10:29.378 STDOUT terraform:   + ingress_alb_access_logs_bucket_id             = (known after apply)
08:10:29.378 STDOUT terraform:   + ingress_alb_access_logs_bucket_paths          = {
08:10:29.378 STDOUT terraform:       + airflow            = "airflow"
08:10:29.378 STDOUT terraform:       + alertmanager       = "alertmanager"
08:10:29.378 STDOUT terraform:       + argo               = "argo"
08:10:29.378 STDOUT terraform:       + argo-events        = "argo-events"
08:10:29.378 STDOUT terraform:       + argo-rollouts      = "argo-rollouts"
08:10:29.378 STDOUT terraform:       + argo-rollouts-demo = "argo-rollouts-demo"
08:10:29.378 STDOUT terraform:       + argo-workflows     = "argo-workflows"
08:10:29.378 STDOUT terraform:       + argocd             = "argocd"
08:10:29.378 STDOUT terraform:       + elasticsearch      = "elasticsearch"
08:10:29.378 STDOUT terraform:       + goldilocks         = "goldilocks"
08:10:29.378 STDOUT terraform:      
08:10:29.378 STDOUT terraform:  + grafana            = "grafana"
08:10:29.378 STDOUT terraform:       + jaeger             = "jaeger"
08:10:29.378 STDOUT terraform:       + jaeger_demo        = "jaeger-demo"
08:10:29.378 STDOUT terraform:       + jenkins            = "jenkins"
08:10:29.378 STDOUT terraform:       + kibana             = "kibana"
08:10:29.378 STDOUT terraform:       + kubeshark          = "kubeshark"
08:10:29.378 STDOUT terraform:       + loki-stack         = "loki-stack"
08:10:29.378 STDOUT terraform:       + prometheus         = "prometheus"
08:10:29.378 STDOUT terraform:     }
08:10:29.378 STDOUT terraform:   + node_security_group_arn                       = (known after apply)
08:10:29.378 STDOUT terraform:   + node_security_group_id                        = (known after apply)
08:10:29.378 STDOUT terraform:   + r53_zone_id                                   = (known after apply)
08:10:29.378 STDOUT terraform:   + r53_zone_name                                 = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
08:10:29.378 STDOUT terraform:   + vpc_id                                        = "vpc-1234"
```

💰 Infracost estimate for `sbx/eu-west-1/infra-01/cluster-01/010_eks`
```
Project: main

 Name                                                                                                Monthly Qty  Unit                    Monthly Cost   
                                                                                                                                                         
 module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_eks_node_group.this[0]                                                                
 └─ module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_launch_template.this[0]                                                            
    ├─ Instance usage (Linux/UNIX, on-demand, m7i.4xlarge)                                                 2,190  hours                      $1,968.37   
    ├─ EC2 detailed monitoring                                                                                21  metrics                        $6.30   
    └─ block_device_mapping[0]                                                                                                                           
       └─ Storage (general purpose SSD, gp3)                                                                 900  GB                            $79.20   
                                                                                                                                                         
 module.cluster.aws_eks_cluster.this[0]                                                                                                                  
 └─ EKS cluster                                                                                              730  hours                         $73.00   
                                                                                                                                                         
 module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_eks_fargate_profile.this[0]                                                             
 ├─ Per GB per hour                                                                                            1  GB                             $3.24   
 └─ Per vCPU per hour                                                                                          1  CPU                           $29.55   
                                                                                                                                                         
 module.cluster.module.kms.aws_kms_key.this[0]                                                                                                           
 ├─ Customer master key                                                                                        1  months                         $1.00   
 ├─ Requests                                                                                   Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                                                                         
 module.ebs_kms_key.module.ebs_kms_key.aws_kms_key.this[0]                                                                                               
 ├─ Customer master key                                                                                        1  months                         $1.00   
 ├─ Requests                                                                                   Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests                                                           Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                                                                         
 aws_route53_zone.cluster_zone                                                                                                                           
 └─ Hosted zone                                                                                                1  months                         $0.50   
                                                                                                                                                         
 aws_route53_record.ns                                                                                                                                   
 ├─ Standard queries (first 1B)                                                                Monthly cost depends on usage: $0.40 per 1M queries       
 ├─ Latency based routing queries (first 1B)                                                   Monthly cost depends on usage: $0.60 per 1M queries       
 └─ Geo DNS queries (first 1B)                                                                 Monthly cost depends on usage: $0.70 per 1M queries       
                                                                                                                                                         
 module.certificate.aws_route53_record.validation[0]                                                                                                     
 ├─ Standard queries (first 1B)                                                                Monthly cost depends on usage: $0.40 per 1M queries       
 ├─ Latency based routing queries (first 1B)                                                   Monthly cost depends on usage: $0.60 per 1M queries       
 └─ Geo DNS queries (first 1B)                                                                 Monthly cost depends on usage: $0.70 per 1M queries       
                                                                                                                                                         
 module.cluster.aws_cloudwatch_log_group.this[0]                                                                                                         
 ├─ Data ingested                                                                              Monthly cost depends on usage: $0.57 per GB               
 ├─ Archival Storage                                                                           Monthly cost depends on usage: $0.03 per GB               
 └─ Insights queries data scanned                                                              Monthly cost depends on usage: $0.0057 per GB             
                                                                                                                                                         
 module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket.this[0]                                                                             
 └─ Standard                                                                                                                                             
    ├─ Storage                                                                                 Monthly cost depends on usage: $0.023 per GB              
    ├─ PUT, COPY, POST, LIST requests                                                          Monthly cost depends on usage: $0.005 per 1k requests     
    ├─ GET, SELECT, and all other requests                                                     Monthly cost depends on usage: $0.0004 per 1k requests    
    ├─ Select data scanned                                                                     Monthly cost depends on usage: $0.002 per GB              
    └─ Select data returned                                                                    Monthly cost depends on usage: $0.0007 per GB             
                                                                                                                                                         
 OVERALL TOTAL                                                                                                                              $2,162.17 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
113 cloud resources were detected:
∙ 10 were estimated
∙ 99 were free
∙ 4 are not supported yet, rerun with --show-skipped to see details

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃        $2,162 ┃           - ┃     $2,162 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
